JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief Frame attribute structure */
typedef struct _netc_tx_frame_info_struct
{
    bool isTsAvail;     /*!< Tx frame timestamp is available or not. */
    uint32_t timestamp; /*!< The timestamp of this Tx frame, valid when isTsAvail is true. */
    bool isTxTsIdAvail; /*!< Switch port Tx frame timestamp Identifier is available or not. */
    uint16_t txtsid; /*!< The Transmit Timestamp Identifier, valid when isTsIdAvail is true, use for Switch management
                        ENETC direct frame which has specified a timestamp request. */
    void *context;   /*!< Private context provided by the user. */
    netc_ep_tx_status_t status; /*!< Transmit status. */
} netc_tx_frame_info_t;

/*! @brief MSIX vector control field */
typedef enum _netc_msix_vector_ctrl
{
    kNETC_MsixIntrMaskBit = 1U, /*!< MSIX vector control interrupt mask bit. */
} netc_msix_vector_ctrl_t;

/*!
 * @brief NETC MSIX entry structure
 */
typedef struct _netc_msix_entry
{
    uint64_t msgAddr; /*!< Message address. */
    uint32_t msgData; /*!< Message data. */
    uint32_t control; /*!< Vector control, netc_msix_vector_ctrl_t. */
} netc_msix_entry_t;

/*! @brief METC Extension Transmit Buffer Descriptor Extension flags field */
typedef enum _netc_tx_ext_flags
{
    kNETC_TxExtVlanInsert = 0x1, /*!< Enable VLAN insert. */
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
    kNETC_TxExtOneStepTs = 0x1 << 1U, /*!< Enable one-step timestamp offload. */
#endif
    kNETC_TxExtTwoStepTs = 0x1 << 2U, /*!< Enable two-step timestamp offload. */
} netc_tx_ext_flags_t;

/*! @} */ // end of netc
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc
#endif

/*!
 * @defgroup netc_abbrev Abbreviation in NETC driver
 * @details Abbreviation list in NETC driver
 *   - UC: unicast
 *   - BC: broadcast
 *   - MC: multicast
 *   - IPF: ingress port filter
 *   - VlanC: Vlan classification
 *   - QosC: Qos Classification
 *   - FRER: Frame Replication and Elimination for Reliability
 *   - PSFP: Per-stream Filtering and Policing
 *   - FM: Frame Modification
 *   - SGI: Stream Gate Instance
 *   - SGC: Stream Gate Control List
 *   - ISI: Ingress Stream Identification
 *   - ISC: Ingress stream count
 *   - IS: Ingress Stream Table
 *   - VF: Vlan Filter
 *   - MF: Mac Filter
 *   - EM: Extract Match
 * @ingroup netc
 */

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw
#endif
/*! @addtogroup netc_hw
 * @{
 */
/*! @brief Get SI information from netc_hw_si_idx_t. */
#define getSiInstance(si) ((uint8_t)((uint16_t)(si) >> 8U))          /*!< The ENETC instance of this SI. */
#define getSiNum(si)      ((uint8_t)(((uint16_t)(si) >> 4U) & 0xFU)) /*!< The SI number in the ENETC. */
#define getSiIdx(si)      ((uint8_t)((uint16_t)(si)&0xFU))           /*!< The actaul index in the netc_hw_si_idx_t. */

/*! @brief ENETC index enumerator */
typedef enum _netc_hw_enetc_idx
{
    kNETC_ENETC0, /*!< ENETC hardware 0 */
    kNETC_ENETC1, /*!< ENETC hardware 0 */
} netc_hw_enetc_idx_t;

/*! @brief SWITCH index enumerator */
typedef enum _netc_hw_switch_idx
{
    kNETC_SWITCH0, /*!< SWITCH hardware 0 */
} netc_hw_switch_idx_t;

/*! @brief Station interface index enumerator */
typedef enum _netc_hw_si_idx
{
    kNETC_ENETC0PSI0 = (0U << 8U) | (0U << 4U) | 0U, /*!< ENETC0 PSI0, index 0 */
    kNETC_ENETC1PSI0 = (1U << 8U) | (0U << 4U) | 1U, /*!< ENETC1 PSI0, index 1 */
    kNETC_ENETC1VSI1 = (1U << 8U) | (1U << 4U) | 2U, /*!< ENETC1 VSI1, index 2 */
} netc_hw_si_idx_t;

/*! @brief Port Resource for the NETC module */
typedef enum _netc_hw_port_idx
{
    kNETC_ENETC0Port   = 0U, /*!< MAC port for ENETC0 */
    kNETC_ENETC1Port   = 0U, /*!< Pseudo MAC port for ENETC1 */
    kNETC_SWITCH0Port0 = 0U, /*!< MAC port0 for SWITCH */
    kNETC_SWITCH0Port1 = 1U, /*!< MAC port1 for SWITCH */
    kNETC_SWITCH0Port2 = 2U, /*!< MAC port2 for SWITCH */
    kNETC_SWITCH0Port3 = 3U, /*!< MAC port3 for SWITCH */
    kNETC_SWITCH0Port4 = 4U, /*!< Pseudo port4 for SWITCH */
} netc_hw_port_idx_t;

/*! @brief Ethernet MAC port resource for the NETC module */
typedef enum _netc_hw_eth_port_idx
{
    kNETC_ENETC0EthPort   = 0U, /*!< Ethernet MAC port for ENETC0 */
    kNETC_SWITCH0EthPort0 = 1U, /*!< Ethernet MAC port0 for SWITCH */
    kNETC_SWITCH0EthPort1 = 2U, /*!< Ethernet MAC port1 for SWITCH */
    kNETC_SWITCH0EthPort2 = 3U, /*!< Ethernet MAC port2 for SWITCH */
    kNETC_SWITCH0EthPort3 = 4U, /*!< Ethernet MAC port3 for SWITCH */
} netc_hw_eth_port_idx_t;

/*! @brief Traffic class enumerator */
typedef enum _netc_hw_tc_idx
{
    kNETC_TxTC0 = 0, /*!< Traffic class 0 */
    kNETC_TxTC1,     /*!< Traffic class 1 */
    kNETC_TxTC2,     /*!< Traffic class 2 */
    kNETC_TxTC3,     /*!< Traffic class 3 */
    kNETC_TxTC4,     /*!< Traffic class 4 */
    kNETC_TxTC5,     /*!< Traffic class 5 */
    kNETC_TxTC6,     /*!< Traffic class 6 */
    kNETC_TxTC7      /*!< Traffic class 7 */
} netc_hw_tc_idx_t;

/*! @brief Enumeration for the ENETC SI BDR identifier */
typedef enum _netc_hw_bdr_idx
{
    kNETC_BDR0 = 0,
    kNETC_BDR1,
    kNETC_BDR2,
    kNETC_BDR3,
    kNETC_BDR4,
    kNETC_BDR5,
    kNETC_BDR6,
    kNETC_BDR7,
    kNETC_BDR8,
    kNETC_BDR9,
    kNETC_BDR10,
    kNETC_BDR11,
    kNETC_BDR12,
    kNETC_BDR13
} netc_hw_bdr_idx_t;

/*! @brief Switch command BD ring index enumerator */
typedef enum _netc_hw_swt_cbdr_idx
{
    kNETC_SWTCBDR0 = 0U, /*!< Switch command BD ring 0 */
    kNETC_SWTCBDR1       /*!< Switch command BD ring 1 */
} netc_hw_swt_cbdr_idx_t;

/*! @brief Enumerator for ETM class queue identifier */
typedef enum _netc_hw_classs_queue_idx
{
    kNETC_ClassQueue0 = 0, /*!< ETM Class Queue 0 */
    kNETC_ClassQueue1,     /*!< ETM Class Queue 1 */
    kNETC_ClassQueue2,     /*!< ETM Class Queue 2 */
    kNETC_ClassQueue3,     /*!< ETM Class Queue 3 */
    kNETC_ClassQueue4,     /*!< ETM Class Queue 4 */
    kNETC_ClassQueue5,     /*!< ETM Class Queue 5 */
    kNETC_ClassQueue6,     /*!< ETM Class Queue 6 */
    kNETC_ClassQueue7      /*!< ETM Class Queue 7 */
} netc_hw_etm_class_queue_idx_t;

