JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief Defines Port TPID acceptance */
typedef enum _netc_port_tpidlist
{
    kNETC_OuterStanCvlan   = 0x1U, /*!< Accept outer Standard C-VLAN 0x8100. */
    kNETC_OuterStanSvlan   = 0x2U, /*!< Accept outer Standard S-VLAN 0x88A8. */
    kNETC_OuterCustomVlan1 = 0x4U, /*!< Accept outer Custom VLAN as defined by CVLANR1[ETYPE]. */
    kNETC_OuterCustomVlan2 = 0x8U, /*!< Accept outer Custom VLAN as defined by CVLANR2[ETYPE]. */
    kNETC_InnerStanCvlan   = 0x1U, /*!< Accept inner Standard C-VLAN 0x8100. */
    kNETC_InnerStanSvlan   = 0x2U, /*!< Accept inner Standard S-VLAN 0x88A8. */
    kNETC_InnerCustomVlan1 = 0x4U, /*!< Accept inner Custom VLAN as defined by CVLANR1[ETYPE]. */
    kNETC_InnerCustomVlan2 = 0x8U, /*!< Accept inner Custom VLAN as defined by CVLANR2[ETYPE]. */
} netc_port_tpidlist_t;

/*! @brief Defines port timestamp selection. */
typedef enum _netc_port_ts_select
{
    kNETC_SyncTime = 0U,  /*!< Synchronized time. */
    kNETC_FreeRunningTime /*!< Free running time. */
} netc_port_ts_select_t;

/*! @brief Port Qos mode */
typedef struct _netc_port_qos_mode
{
    uint8_t qosVlanMap : 4; /*!< Transmit QoS to VLAN PCP Mapping Profile index, only active on switch port */
    uint8_t vlanQosMap : 4; /*!< Receive VLAN PCP/DE to QoS Mapping Profile index, only active on switch port */
    uint8_t defaultIpv : 3; /*!< Port default IPV */
    uint8_t defaultDr : 2;  /*!< Port default DR */
    bool enVlanInfo : 1;    /*!< Enable use VLAN info to determine IPV and DR (base on VLANIPVMPaR0/1 and VLANDRMPaR) */
    bool vlanTagSelect : 1; /*!< True: Outer VLAN, False: Innner VLAN. Active when enVlanInfo is true */
} netc_port_qos_mode_t;

/*! @brief Port Parser config */
typedef struct _netc_port_parser_config
{
    uint8_t l2PloadCount : 5;   /*!< L2 payload fields size in bytes */
    bool enableL3Parser : 1;    /*!< Enable/Disable parser for L3 */
    uint8_t l3PayloadCount : 5; /*!< L3 payload fields size in bytes */
    bool enableL4Parser : 1;    /*!< Enable/Disable parser for L4 */
    uint8_t l4PayloadCount : 5; /*!< L4 payload fields size in bytes */
} netc_port_parser_config_t;

/*! @brief Port time gate config */
typedef struct _netc_port_tg_config
{
    uint16_t advOffset; /*!< Advance time offset in ns. */
    uint32_t holdSkew;  /*!< Hold-Skew in ns, not effective on ports connected to a pseudo-MAC */
} netc_port_tg_config_t;

/*! @brief Port MAC preemption mode */
typedef enum _netc_hw_preemption_mode
{
    kNETC_PreemptDisable = 0U, /*!< Frame preemption is not enabled */
    kNETC_PreemptOn64B,        /*!< Frame preemption is enabled, but transmit only preempts frames on 64B boundaries */
    kNETC_PreemptOn4B          /*!< Frame preemption is enabled, but transmit only preempts frames on 4B boundaries */
} netc_hw_preemption_mode_t;

/*! @brief Configuration for the Credit Based Shaped for port TC.
 *
 *  @note  The 802.1Qav bandwidth availability parameters is is calculated as follows:
 *          - idleSlope (bits) = portTxRate * bwWeight / 100
 *          - sendSlope (bits) = portTxRate * (100 - bwWeight) / 100
 *          - lowCredit (bits) = tcMaxFrameSize * (100 - bwWeight) / 100
 *          - hiCredit (bits) calculation formula depends on the traffic class, Please refer to the Reference manual.
 *          - hiCredit (credits) = (enetClockFrequency / portTxRate) * 100 * hiCredit (bits)
 */
typedef struct _netc_port_tc_cbs_config
{
    uint8_t bwWeight;  /*!< Percentage units of the port transmit rate and the credit-based shaper (range from 0 ~ 100),
                           the sum of all traffic class credit-based shaper's bandwidth cannot exceed 100 */
    uint32_t hiCredit; /*!< The maximum allowed accumulation of credits when conflicting transfers occur,
                          in credit units ((enetClockFrequency / portTxRate) * 100) */
} netc_port_tc_cbs_config_t;

/*! @brief Type of PDU/SDU (Protocol/Service Data Unit).
 *
 *  @note  Overhead values which adding to the transmitted frame of Length are specified by Port SDU config as follows:
 *          - PPDU = add rxPpduBco/txPpduBco + rxMacsecBco/txMacsecBco bytes
 *          - MPDU = add rxMacsecBco/txMacsecBco bytes
 *          - MSDU = minus 16B (12B MAC Header + 4B FCS)
 */
typedef enum _netc_tc_sdu_type
{
    kNETC_PDU = 0U, /*!< Physical Layer PDU, Preamble, IFG, SFD along with MPDU. Not supported if cut-through frames are
                       expected */
    kNETC_MPDU,     /*!< MAC PDU, MAC Header, MSDU and FCS */
    kNETC_MSDU /*!< MAC SDU, MPDU minus 12B MAC Header and 4B FCS. Not supported if cut-through frames are expected */
} netc_tc_sdu_type_t;

typedef struct _netc_port_tc_sdu_config
{
    bool enTxMaxSduCheck; /*!< Enable Tx Max SDU check for Store and Forward frames, the frame which greater than
                           maxSduSized wiil be discarded, Cut-Through frames will always perform Max SDU check */
    netc_tc_sdu_type_t
        sduType;          /*!< Specifies the type of PDU/SDU whose length is being validated as seen on the link */
    uint16_t maxSduSized; /*!< Transmit Maximum SDU size in bytes, the dequeued frame will be discarded when it SDU size
                             exceeds this value */
} netc_port_tc_sdu_config_t;

/*! @brief Configuration for the port Tx Traffic Class */
typedef struct _netc_port_tx_tc_config
{
    bool enPreemption : 1; /*!< Frames from traffic class are transmitted on the preemptable MAC, not supported on
                          internal port (ENETC 1 port and Switch port 4)*/
    bool enableTsd : 1;    /*!< Enable Time Specific Departure traffic class, only applicable to ENETC */
    bool enableCbs : 1;    /*!< Enable Credit based shaper for traffic class  */
    netc_port_tc_sdu_config_t sduCfg;
    netc_port_tc_cbs_config_t cbsCfg; /*!< Configure transmit traffic class credit based shaper (PTC0CBSR0/PTC0CBSR1) if
                                  enableCbs set to ture */
} netc_port_tx_tc_config_t;

/*! @brief Switch or ENETC port Tx/Rx/Bridge discard statistic / reason */
typedef struct _netc_port_discard_statistic
{
    uint32_t count;   /*!< Count of discarded frames. PRXDCR, PTXDCR or BPDCR. */
    uint32_t reason0; /*!< Discard Reason. Find bit detail from PT/RXDCRR0 or BPDCRR0. */
    uint32_t reason1; /*!< Discard Reason. Find bit detail from PT/RXDCRR1 or BPDCRR1.*/
} netc_port_discard_statistic_t;

/*! @brief Port accepted Vlan classification config */
typedef struct _netc_port_vlan_classify_config
{
    uint8_t innerMask : 4; /*!< Bitmap identifying which TPIDs are acceptable as Inner VLAN tag. See PTAR */
    uint8_t outerMask : 4; /*!< Bitmap identifying which TPIDs are acceptable as Outter VLAN tag. See PTAR */
} netc_port_vlan_classify_config_t;

/*! @brief Port Qos Classification Config */
typedef struct _netc_port_qos_classify_configs
{
    uint8_t vlanQosMap : 4; /*!< Receive VLAN PCP/DE to QoS Mapping Profile index */
    uint8_t defaultIpv : 3; /*!< Port default IPV */
    uint8_t defaultDr : 2;  /*!< Port default DR */
    bool enVlanInfo : 1; /*!< Enable use VLAN info to determine IPV and DR ,base on VLAN to IPV map (VLANIPVMPaR0/1) and
                            VLAN to DR map (VLANDRMPaR) */
    bool vlanTagSelect : 1; /*!< True: Use received Outer VLAN, False: Use received Innner VLAN. Active when enVlanInfo
                               is true */
} netc_port_qos_classify_config_t;

/*! @brief Port Ingress Filter Config */
typedef struct _netc_port_ipf_config_t
{
    bool enL2Dos : 1;    /*!< Enable port L2 Ethernet DoS Protection */
    bool enL3Dos : 1;    /*!< Enable port L3 IP DoS Protection */
    bool enIPFTable : 1; /*!< Enable port IPF lookup */
} netc_port_ipf_config_t;

/*! @brief PSFP port config */
/*!
 * @brief Port ingress stream identification config
 *
 * @note The first stream identification find IS_EID has higher precedence value than the second, and the priority of
 *       the IS_EID found by the IPF is specified by the IPF entry RRR bit. The possible orderings are as follows
 *          - RRR = 00b : IPF > enKC0 > enKC1 > defaultISEID
 *          - RRR = 01b : enKC0 > IPF > enKC1 > defaultISEID
 *          - RRR = 10b : enKC0 > enKC1 > IPF > defaultISEID
 */
typedef struct _netc_port_psfp_isi_config
{
    uint16_t defaultISEID; /*!< Default Ingress Stream Entry ID, has lower precedence value than ISI entry and IPF entry
                              defined IS_EID. 0xFFFF means NULL */
    bool enKC1 : 1;        /*!< Enable do the second stream identification with key construction rule 1 or rule 3 */
    bool enKC0 : 1;        /*!< Enable do the first stream identification with key construction rule 0 or rule 2 */
    bool kcPair : 1; /*!< Indicates which Key Construction pair to use for this port, false - user pair0. true - use
                        pair1 only applicable for Switch */
} netc_port_psfp_isi_config;

