JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
typedef struct _netc_port_ethmac
{
    bool enableRevMii : 1;                /*!< Enable RevMII mode. */
    netc_port_ts_select_t txTsSelect : 1; /*!< Tx timestamp clock source. */
    netc_hw_mii_mode_t miiMode : 3;       /*!< MII mode. */
    netc_hw_mii_speed_t miiSpeed : 2;     /*!< MII Speed. */
    netc_hw_mii_duplex_t miiDuplex : 1;   /*!< MII duplex. */
    bool enTxPad : 1; /*!< Enable ETH MAC Tx Padding, which will pad the frame to a minimum of 60 bytes and append 4
                         octets of FCS. */
    uint8_t rxMinFrameSize : 7; /*!< Receive Minimum Frame Length size in bytes, range in 18 ~ 64, received frames
                                   shorter than 18B are discarded silently. Both for express MAC and preemptable MAC. */
    uint16_t rxMaxFrameSize;    /*!< Receive Maximum Frame Length size in bytes, up to 2000, received frames that exceed
                                   this stated maximum are truncated. Both for express MAC and preemptable MAC. */
    bool enMergeVerify : 1; /*!< Enable verify the merged preemption frame, need to enable when preemptMode is not zero
                             */
    uint8_t mergeVerifyTime : 7; /*!< The nominal wait time between verification attempts in milliseconds, range in 1 ~
                                    128 */
    netc_hw_preemption_mode_t preemptMode : 2; /*!< When set to not zero, PMAC frames may be preempted by EMAC frames */
#if !(defined(FSL_FEATURE_NETC_HAS_ERRATA_051255) && FSL_FEATURE_NETC_HAS_ERRATA_051255)
    bool enOneStepTS : 1;        /*!< Enable IEEE-1588 Single-Step timestamp */
    bool enChUpdate : 1;         /*!< Enable correction UDP checksum when enable Single-Step timestamp */
    uint16_t oneStepOffset : 10; /*!< Start offset from the beginning of a frame where the field to update is found
                                    (index to MS byte) */
#endif
} netc_port_ethmac_t;

/*! @brief Defines the Port's Stream Gate Open Gate Check mode. */
typedef enum _netc_port_sg_ogc_mode
{
    kNETC_SGCheckSFD = 0U, /*!< Check whether frame SFD is within the open gate interval. */
    kNETC_SGCheckEntire    /*!< Check whether the entire frame is within the open gate interval. */
} netc_port_sg_ogc_mode_t;

/*! @brief Port common configuration */
typedef struct _netc_port_common
{
    netc_port_vlan_classify_config_t acceptTpid; /*!< Port acceptable VLAN tpid configure. */
    netc_port_ts_select_t rxTsSelect;            /*!< Eth MAC Rx or pseudo MAC Tx timestamp clock source */
    uint16_t pSpeed; /*!< Transmit Port Speed = 10Mbps * (pSpeed+1), Used by ETS, Qbu and to determine if cut-through is
                        permissable  */
    uint8_t rxMacsecBco; /*!< Port receive MACSec byte count overhead which due to MACSec encapsulation */
    uint8_t rxPpduBco;   /*!< Port receive PPDU Byte count overhead which includes IPG, SFD and Preamble */
    uint8_t txMacsecBco; /*!< Port transmit MACSec byte count overhead which due to MACSec encapsulation */
    uint8_t txPpduBco;   /*!< Port transmit PPDU Byte count overhead which includes IPG, SFD and Preamble */
    bool stompFcs : 1;   /*!< Enable stomp the FCS error frame, not effective on ports connected to a pseudo-MAC */
    netc_port_sg_ogc_mode_t ogcMode : 1; /*!< Stream Gate Open Gate Check mode, 0b is check whether SFD is within the
                         open gate interval, 1b is check whether the entire frame is within the open gate interval */
    uint32_t pDelay : 24;                /*!< Link propagation delay in ns */
    uint8_t macAddr[6]; /*!< Port MAC address, used for Switch egress frame modification action or ENETC SI0 primary MAC
                           address  */
    netc_port_qos_classify_config_t qosMode; /*!< Port Rx Qos Classification config */
    netc_port_ipf_config_t ipfCfg;           /*!< Port ingress port filter configuration */
    netc_port_tg_config_t timeGate;          /*!< Port Tx time gate config */
    netc_port_parser_config_t parser;        /*!< Port Rx Parser config */
} netc_port_common_t;

/*! @} */ // end of netc_hw_port
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_port
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_port_mac
#endif
/*! @addtogroup netc_hw_port_mac
 * @{
 */

/*! @brief Defines the Ethernet MAC physical port type. */
typedef enum _netc_port_phy_mac_tpye
{
    kNETC_ExpressMAC = 0U, /*!< The MAC which handles express traffic when frame preemption is enabled or handles all
                              traffic when frame preemption is disabled. */
    kNETC_PreemptableMAC   /*!< The MAC which handles preemptive traffic when frame preemption is enabled. */
} netc_port_phy_mac_tpye_t;

/*! @brief Definesthe state of the mac merge sublayer with respect to verification as defined in IEEE Std 802.3br-2016.
 */
typedef enum _netc_port_preemption_verify_status
{
    kNETC_VerifyDisable    = 0U, /*!< Verification is disabled */
    kNETC_VerifyInProgress = 2U, /*!< Verification is in progress */
    kNETC_VerifySuccess,         /*!<  Verification was successful */
    kNETC_VerifyFaile,           /*!<  Verification failed */
    kNETC_VerifyUndefined        /*!< Verification is in an undefined state */
} netc_port_preemption_verify_status_t;

/*! @brief Port MAC preemption Status */
typedef struct _netc_port_phy_mac_preemption_status
{
    bool mergeActive;                                  /*!< Transmit preemption is active or not */
    netc_port_preemption_verify_status_t verifyStatus; /*!< Transmit preemption is active or not */
} netc_port_phy_mac_preemption_status_t;

/*! @brief Ethernet MAC physical port traffic (Tx/Rx) statistics counters, when enable frame preemption, one physical
 *         MAC will be divided into a pMAC and a eMAC and statistics counters will also have two groups */
typedef struct _netc_port_phy_mac_traffic_statistic
{
    uint64_t totalOctet;             /*!< Count of MAC received/transmitted good/error Ethernet octets. */
    uint64_t validOctet;             /*!< Count of MAC received/transmitted good Ethernet octets. */
    uint64_t pauseFrame;             /*!< Count of MAC received/transmitted valid PAUSE frames. */
    uint64_t validFrame;             /*!< Count of MAC received/transmitted valid frames. */
    uint64_t vlanFrame;              /*!< Count of MAC received/transmitted valid VLAN tagged frames. */
    uint64_t unicastFrame;           /*!< Count of MAC received/transmitted valid unicast frames. */
    uint64_t multicastFrame;         /*!< Count of MAC received/transmitted valid multicast frames. */
    uint64_t boradcastFrame;         /*!< Count of MAC received/transmitted valid broadcast frames. */
    uint64_t totalPacket;            /*!< Count of MAC received/transmitted good/error packets. */
    uint64_t rxMinPacket;            /*!< Count of MAC received min to 63-octet packets. */
    uint64_t total64BPacket;         /*!< Count of MAC received/transmitted 64 octet packets. */
    uint64_t total65To127BPacket;    /*!< Count of MAC received/transmitted 65 to 127 octet packets. */
    uint64_t total128To255BPacket;   /*!< Count of MAC received/transmitted 128 to 255 octet packets. */
    uint64_t total256To511BPacket;   /*!< Count of MAC received/transmitted 256 to 511 octet packets. */
    uint64_t total511To1023BPacket;  /*!< Count of MAC received/transmitted 512 to 1023 octet packets. */
    uint64_t total1024To1522BPacket; /*!< Count of MAC received/transmitted 1024 to 1522 octet packets. */
    uint64_t total1523ToMaxBPacket;  /*!< Count of MAC received/transmitted 1523 to Max octet packets. */
    uint64_t controlPacket;          /*!< Count of MAC received/transmitted control packets. */
} netc_port_phy_mac_traffic_statistic_t;

