JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief Ethernet MAC physical port frame discard/errors status statistics counters, when enable frame preemption, one
 * physical MAC will be divided into a pMAC and a eMAC and statistics counters will also have two groups */
typedef struct _netc_port_phy_mac_discard_statistic
{
    uint64_t rxError;              /*!< Count of MAC received error frames. */
    uint64_t rxUndersized;         /*!< Count of MAC received undersized frames. */
    uint64_t rxOversized;          /*!< Count of MAC received oversized frames. */
    uint64_t rxErrorFCS;           /*!< Count of MAC received check sequence (FCS) error frames. */
    uint64_t rxFragment;           /*!< Count of MAC frames which is shorter than the MIN length and received with a
                                        wrong FCS/CRC. */
    uint64_t rxJabber;             /*!< Count of MAC frames which is larger than the MAX length and received with a
                                        wrong FCS/CRC. */
    uint64_t rxDiscard;            /*!< Count of MAC drops frame. */
    uint64_t rxDiscardNoTruncated; /*!< Count of MAC non-truncated drops frame. */
    uint64_t txErrorFCS;           /*!< Count of MAC transmitted bad FCS frames. */
    uint64_t txUndersized;         /*!< Count of MAC transmitted less than 64B with good FCS frames. */
} netc_port_phy_mac_discard_statistic_t;

/*! @brief Ethernet physical MAC port preemption (Tx/Rx) related statistics counters */
typedef struct _netc_port_phy_mac_preemption_statistic
{
    uint32_t rxReassembledFrame; /*!< Count of MAC frames that were successfully reassembled and delivered to
                                      the MAC. */
    uint32_t rxReassembledError; /*!< Count of MAC frames with reassembly errors. */
    uint32_t rxMPacket;          /*!< Count of the number of additional mPackets received due to preemption. */
    uint32_t rxSMDError;         /*!< Count of received MAC frames / MAC frame fragments rejected due to unknown SMD. */
    uint32_t txPreemptionReq;    /*!< Count of the number of tx preemption HOLD requests. */
    uint32_t txMPacket;          /*!< Count of the number of additional mPackets transmitted due to preemption. */
} netc_port_phy_mac_preemption_statistic_t;

/*! @brief Ethernet pseudo MAC port traffic (Tx/Rx) statistics counters */
typedef struct _netc_port_pseudo_mac_traffic_statistic
{
    uint64_t totalOctet;     /*!< Count of MAC received/transmitted octets. */
    uint64_t unicastFrame;   /*!< Count of MAC received/transmitted unicast frames. */
    uint64_t multicastFrame; /*!< Count of MAC received/transmitted multicast frames. */
    uint64_t boradcastFrame; /*!< Count of MAC received/transmitted broadcast frames . */
} netc_port_pseudo_mac_traffic_statistic_t;

/*! @} */ // end of netc_hw_port_mac
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_port_mac
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_table
#endif
/*! @addtogroup netc_hw_table
 * @{
 */

/*! @brief Table index */
typedef enum _netc_tb_index
{
    kNETC_TGSTable   = 5U,  /*!< Time Gate Scheduling table index */
    kNETC_RPTable    = 10U, /*!< Rate Policer table index */
    kNETC_IPFTable   = 13U, /*!< Ingress Port filter table index */
    kNETC_FDBTable   = 15U, /*!< FDB table index */
    kNETC_L2MCFTable = 16U, /*!< L2 IPV4 Multicast Filter table index */
    kNETC_VFTable    = 18U, /*!< VLAN Filter table index */
    kNETC_ECQTable   = 22U, /*!< ETM Class Queue table index */
    kNETC_ECSTable   = 23U, /*!< ETM Class Scheduler table index */
    kNETC_ISITable   = 30U, /*!< Ingress Stream Identification table index */
    kNETC_ISTable    = 31U, /*!< Ingress Stream table index */
    kNETC_ISFTable   = 32U, /*!< Ingress Stream Filter table index */
    kNETC_ETTable    = 33U, /*!< Egress Treatment table index */
    kNETC_ISGTable   = 34U, /*!< Ingress Sequence Generation table index */
    kNETC_ESRTable   = 35U, /*!< Egress Sequence Recovery table index */
    kNETC_SGITable   = 36U, /*!< Stream Gate Instance table index */
    kNETC_SGCLTable  = 37U, /*!< Stream Gate Control List table index */
    kNETC_ISCTable   = 38U, /*!< Ingress Stream Count table index */
    kNETC_ECTable    = 39U, /*!< Egress Count table index */
    kNETC_FMTable    = 40U, /*!< Frame Modification table index */
    kNETC_BPTable    = 41U, /*!< Buffer Pool table index */
    kNETC_SBPTable   = 42U, /*!< Shared Buffer Pool table index */
    kNETC_ECGTable   = 43U, /*!< ETM Class Group table index */
    kNETC_FMDTable   = 44U  /*!< Frame Modification Data table index */
} netc_tb_index_t;

/*! @brief Table management command operations */
typedef enum _netc_tb_cmd
{
    kNETC_DeleteEntry         = 0x1U, /*!< Delete operation */
    kNETC_UpdateEntry         = 0x2U, /*!< Update operation */
    kNETC_QueryEntry          = 0x4U, /*!< Query operation */
    kNETC_QueryAndDeleteEntry = 0x5U, /*!< Query operation followed by a delete operation */
    kNETC_QueryAndUpdateEntry = 0x6U, /*!< Query operation followed by a update operation */
    kNETC_AddEntry            = 0x8U, /*!< Add operation */
    kNETC_AddOrUpdateEntry = 0xAU, /*!< If the entry exists, is update operation, if not exist, is the Add operation*/
    kNETC_AddAndQueryEntry = 0xCU, /*!< Add operation followed by a query operation */
    kNETC_AddQueryAndUpdateEntry =
        0xEU /*!< Add operation followed by a query operation, Then, if the entry existed
                  prior to the Add operation of this command, the Update operation will be performed. */
} netc_tb_cmd_t;

/*! @brief Table Access Method */
typedef enum _netc_tb_access_mode
{
    kNETC_EntryIDMatch = 0U, /*!< Entry ID Match */
    kNETC_ExactKeyMatch,     /*!< Exact Match Key Element Match */
    kNETC_Search,            /*!< Search with search criteria*/
    kNETC_TernaryKeyMatch    /*!< Ternary Match Key Element Match */
} netc_tb_access_mode_t;

typedef enum _netc_cbd_version
{
    kNETC_NtmpV1_0 = 0U, /*!< NTMP Version 1.0 */
    kNETC_NtmpV2_0       /*!< NTMP Version 2.0 */
} netc_cbd_version_t;

/*! @brief Table command response error status */
typedef enum _netc_cmd_error
{
    /* Version 1.0 NTMP Table error status */
    kNETC_FormatError = 0x1U, /*!< Format error : 1. Illegal class or command. 2. Invalid SF bit setting. 3. LENGTH is
                                 zero for long format. 4. LENGTH is too small for buffer size. */
    kNETC_SizeError = 0x2U,   /*!< Size error : 1. Invalid table index, out of range. 2. Table overflow, no additional
                                 entries available. */
    kNETC_AccessError    = 0x4U, /*!< Access violation error, the entity is not allowed to perform the task requested */
    kNETC_ClassError     = 0x8U, /*!< Class specific error */
    kNETC_IntegrityError = 0x10U, /*!< Integrity error, the command did not execute due to a data integrity error (ECC
                                     on internal memory or AXI read/write error) */
    /* Version 2.0 NTMP Table Generic error status */
    kNETC_InvTableID         = 0x80U, /*!< Invalid table ID */
    kNETC_InvAccMethod       = 0x81U, /*!< Invalid Access method */
    kNETC_TableIdxOutRange   = 0x82U, /*!< Table index out of range */
    kNETC_DBNotEnough        = 0x83U, /*!< Request data buffer size or response data buffer size is not sufficient */
    kNETC_InvCmd             = 0x84U, /*!< Invalid command */
    kNETC_ReqDBError         = 0x85U, /*!< Request Data buffer error */
    kNETC_MultiBitError      = 0x86U, /*!< Multi-bit ECC or parity error observed during command processing */
    kNETC_HashEntryLimit     = 0x87U, /*!< Exceeded hash entry limit */
    kNETC_HashChainLimit     = 0x88U, /*!< Exceeded maximum hash collision chain limit and the CAM if present is full */
    kNETC_InvHWGenEntryID    = 0x89U, /*!< Invalid ENTRY_ID for ENTRY_ID generated by hardware */
    kNETC_SrchResDBNotEnough = 0x8AU, /*!< Search command filled the response data buffer before completing the
                                           command */
    kNETC_CmdIdxTableWithITM   = 0x8BU, /*!< Command for index table before OSR[ITM_STATE]=0 */
    kNETC_InvQueryAction       = 0x8CU, /*!< Invalid Query action */
    kNETC_InvTableAccPrivilege = 0x8DU, /*!< Invalid table access privilege */
    kNETC_ReadSysBusErr        = 0x8EU, /*!< System Bus Read Error */
    kNETC_WriteSysBusErr       = 0x8FU, /*!< System Bus Write Error */
    kNETC_ClientErr            = 0x90U, /*!< Client encountered a fault */
    /* Time Gate Scheduling Table error status */
    kNETC_TGSCmdIssue        = 0xD0U,  /*!< Command issued when time gating function is disabled for the port. */
    kNETC_TGSUpdateExistList = 0xD1U,  /*!< Update action attempted on an existing admin gate control list. (should
                                      delete   admin gate control list first before creating a new admin list) */
    kNETC_TGSUpdateOverLength = 0xD2U, /*!< Update action attempted exceeds TGSTCAPR[MAX_GCL_LEN] */
    kNETC_TGSUpdateOverSize   = 0xD3U, /*!< Update action attempted exceeds TGSTCAPR[NUM_WORDS]. */
    kNETC_TGSEntryNotEnough   = 0xD4U, /*!< Insufficient resources to perform the requested operation (not enough free
                                          time gate list entries) */
    kNETC_TGSUpdateNSList = 0xD5U,     /*!< Update action attempted with ADMIN_CYCLE_TIME, ADMIN_TIME_INTERVAL_GE_i or
                        truncated ADMIN_TIME_INTERVAL_GE_n due ADMIN_CYCLE_TIME specified is not sufficient to transmit 64
                        byte of frame data + header overhead. */
    kNETC_TGSUpdateEarlierStartTime = 0xD6U, /*!< Update action attempted with ADMIN_BASE_TIME specified s more than one
                                                second in the past from tcs advance time. */
    kNETC_TGSUpdateOverflowCycle = 0xD7U,   /*!< Update action attempted with ADMIN_CYCLE_TIME + ADMIN_CYCLE_TIME_EXT is
                                           greater than 2^32-1. */
    kNETC_TGSQueryBeforeListActive = 0xD8U, /*!< Query action issued when config change occurred. Retry query.*/
    kNETC_TGSUpdateInvGateValue = 0xD9U, /*!< Update action attempted with ADMIN_HR_CB_GE_i set to an invalid value */
    /* Rate Policer Table error status */
    kNETC_RPSDUTypeOutRange = 0x120U, /*!< SDU_TYPE specified in entry CFGE_DATA is out of range */
    /* Ingress Port Filter Table error status */
    kNETC_IPFInvHR = 0x150U,           /*!< HR value not valid. Only checked if command issued from the Switch
                                          and FLTFA=0x2 or FLTFA=0x3 */
    kNETC_IPFEntryNotFit     = 0x151U, /*!< Entry being added does not fit in table */
    kNETC_IPFWithoutSTSE     = 0x152U, /*!< CFGE_DATA update without STSE_DATA update */
    kNETC_IPFInvRPP          = 0x154U, /*!< RPR set to a reserved value. Only checked if FLTA=0x2. */
    kNETC_IPFFLTATGTOutRange = 0x155U, /*!< FLTA_TGT is outside valid range and not NULL. Only checked if FLTA>0x0 */
    kNETC_IPFInvSwtFLTA      = 0x156U, /*!< FLTA=0x3 when command issued from the Switch. */
    kNETC_IPFInvEnetcFLTA    = 0x157U, /*!< FLTFA>0x1 when command issued from an ENETC PF. */
    /* FDB Table error status */
    kNETC_FDBReachPortLimit = 0x171U, /*!< Failed to add or update and entry because the Port BPCR[DYN_LIMIT] has
                                           been reached */
    kNETC_FDBReachSwtLimit = 0x172U,  /*!< Failed to add entry because the Switch FDBHTMCR[DYN_LIMIT] has been
                                           reached. */
    kNETC_FDBInvEPORT      = 0x173U,  /*!< EPORT value not valid. Only checked if (OETEID=0x1 OR CTD=0x1) */
    kNETC_FDBETEIDOutRange = 0x174U,  /*!< ET_EID is out of range and not NULL. Only checked if OETEID>0x0 */
    kNETC_FDBParityErr     = 0x175U,  /*!< Parity error encountered when adding guaranteed entry */
    /* L2 IPv4 Multicast Filter Table error status */
    kNETC_L2MCFInvEPORT      = 0x181U, /*!< EPORT value not valid. Only checked if (OETEID=0x1 OR CTD=0x1) */
    kNETC_L2MCFETEIDOutRange = 0x182U, /*!< ET_EID is not NULL or within the valid range. Only checked if OETEID>0x0. */
    kNETC_L2MCFInvKEYTYPE    = 0x183U, /*!< KEY_TYPE value not valid */
    /* VLAN Filter Table error status */
    kNETC_VFBASEETEIDOutRange = 0x1A0U, /*!< BASE_ET_EID is out of range or MLO is not valid. */
    /* ETM Class Queue Table error status */
    kNETC_ECQCQ2CGMAPOutRange = 0x1E0U, /*!< CQ2CG_MAP value out-of-range in update command. */
    /* Ingress Stream Identification Table error status */
    kNETC_ISIPortIDOutRange = 0x260U, /*!< Port ID specified in KEYE_DATA is out of range. */
    kNETC_ISIInvISEID       = 0x261U, /*!< IS_EID in invalid. */
    /* Ingress Stream Table error status */
    kNETC_ISInvOpt = 0x270U,   /*!< Option specified in one or more of the following fields is not valid – FA, CTD or
                                       ISQA, SDU_TYPE. */
    kNETC_ISInvID = 0x271U,    /*!< One or more of following : 1. Entry IDs are not in valid range or Entry ID is not
                                  Null. 2. Check valid ranges specified for these Entry IDs in Ingress Stream table entry –
                                  RP_EID, SGI_EID, ISQ_EID, ET_EID or EPORT. 3. ET_EID is checked if (FA =010b .. 101b) &
                                  (OETEID!=0). 4. EPORT is checked if (FA = 010b .. 101b) & (OETEID= 0x1 OR CTD= 0x1). 5.
                                  HR is chked if FA = 001b, 100b, or 101b. HR specified cannot be 0x0*/
    kNETC_ISInvFMEID = 0x272U, /*!< FM_EID format or index is out of range : 1. FM_EID format option type is invalid. 2.
                                  FM_EID format is option 1 and the Index is out of range and not Null, or FM_EID format
                                  is option 2 and VUDA or SQTA is out of range.*/
    /* Ingress Stream Filter Table error status */
    kNETC_ISFInvISEID = 0x280U, /*!< IS_EID in KEYE_DATA is invalid. */
    kNETC_ISFInvCFGE = 0x281U, /*!< Any of the following in CFGE_DATA is invalid : 1. One or more of following Entry IDs
                                are not in valid range or Entry ID specified is not Null. Checks are performed for
                                following Entry IDs CFGE DATA – RP_EID, SGI_EID, ISC_EID. 2. SDU_TYPE is invalid */
    /* Egress Treatment Table error status */
    kNETC_ETInvOpt = 0x290U, /*!< Command option specified is invalid or not supported. ESQA is not 00 or 10 (others are
                                reserved), or ECA > 1 (reserved). */
    kNETC_ETInvFMEID = 0x291U, /*!< FM_EID format or index is out of range. Check performed is as follows : 1. EFM_EID
                                  format option type is invalid, or EFM_EID format is option 1 and the Index is out of
                                  range and not Null, or EFM_EID format is option 2 and VUDA or SQTA is out of range
                                  . 2. the Egress Counter Table index EC_EID is out of range. 3. The Egress Sequence
                                  Actions Target Entry ID ESQA_TGT_EID is out of range*/
    /* Ingress Sequence Generation Table error status */
    kNETC_ISGInvQSTAG = 0x2A0U, /*!< SQ_TAG specified is not valid */
    /* Stream Gate Instance Table error status */
    kNETC_SGISGCLEIDOutRange = 0x2C0U,  /*!< SGCL_EID specified in out of range for Add or Update operation. */
    kNETC_SGIInvSDUTYPE      = 0x2C1U,  /*!< SDU_TYPE is specified is invalid for Add or Update operation. */
    kNETC_SGISGCLEIDNotAlloc = 0x2C2U,  /*!< Either the SGCL_EID specified as admin gate control list in Add or Update
                                      operation has not been allocated or SGCL_EID is not the first entry in gate control
                                      list or the reference count in SGCL entry is not 0. */
    kNETC_SGIInvSGCLEID       = 0x2C3U, /*!< SGCL_EID specified for Update operation is in invalid.  */
    kNETC_SGIInvADMINBASETIME = 0x2C4U, /*!< ADMIN_BASE_TIME specified for Add or Update operation is more than 2^30ns
                                        in the past. */
    kNETC_SGIInvCYCLETIME = 0x2C5U,     /*!< Cumulated time value of CYCLE_TIME in Stream gate Control list plus
                                            CYCLE_TIME_EXT specified in Add or Update operation is >=2^30ns or
                                            CYCLE_TIME specified is 0. */
    /* Stream Gate Control List Table error status */
    kNETC_SGCLOverLength = 0x2D0U,       /*!< Number words required for the LIST_LENGTH specified for the Add operation
                                            exceeds the number of words allocated for SGCL table */
    kNETC_SGCLTimeIntervalZero = 0x2D1U, /*!< TIME_INTERVAL_GE_N specified in Add operation is 0. Note that upper
                            2 bits of TIME_INTERVAL_GE_N are ignored, TIME_INTERVAL_GE_N[29:0] must not be 0. */
    kNETC_SGCLTimeIntervalOverflow = 0x2D2U, /*!< Cumulated time value of TIME_INTERVAL_GE_N[29:0] for the gate list
                                                specified in Add operation is >= 2^30ns. */
    /* Frame Modification Table error status */
    kNETC_FMInvEMEID    = 0x300U, /*!< FM_EID format is invalid */
    kNETC_FMOptOutRange = 0x301U, /*!< Following fields specified are out of range - MAC_HDR_ACT, VLAN_HDR_ACT, SQT_ACT,
                                     OUTER_PCP_DEI_ACT, PLD_ACT. */
    kNETC_FMFMDOutRange = 0x302U, /*!< FMD_EID,FMD_BYTES specified is out of range. When FMD_EID is not set to Null,
                                     valid range is FMD_EID[15:0]*24 + FMD_BYTES <= (FMDITCAPR[NUM_WORDS]*24).*/
    /* Buffer Pool Table error status */
    kNETC_BPSBPEIDOutRange = 0x310U, /*!< SBP_EN is 1 and SBP_EID value is out-of-range in update command */
} netc_cmd_error_t;

/*! @brief The Switch/SI command BD data structure */
typedef union _netc_cmd_bd
{
    struct
    {
        uint64_t addr; /*!< The request and response data buffers address */
        struct
        {
            uint32_t resLength : 20; /*!< The length of the Response Data Buffer */
            uint32_t reqLength : 12; /*!< The length of the Request Data Buffer */
        };
        struct
        {
            netc_tb_cmd_t cmd : 4; /*!< Access table entry command, see @ref netc_tb_cmd_t . */
            uint32_t : 8;
            netc_tb_access_mode_t accessType : 2; /*!< Access table entry method, see @ref netc_tb_access_mode_t. */
            uint32_t : 2;                         /*!< RSS Hash high field value. */
            netc_tb_index_t tableId : 8;
            uint32_t version : 6;   /*!< Protocol Version. */
            uint32_t enCompInt : 1; /*!< Command Completion Interrupt. */
            uint32_t resReady : 1;  /*!< Response Ready. */
        };
        uint32_t reserved[3];
        struct
        {
            uint32_t : 15;
            uint32_t npf : 1; /*!< NTMP Protocol Format. */
            uint32_t : 16;
        };
    } req;
    struct
    {
        uint32_t reserved1[3];
        struct
        {
            uint32_t numMatched : 16; /*!< Number of Entries Matched. */
            uint32_t error : 12;      /*!< Error status. */
            uint32_t : 3;
            uint32_t resReady : 1; /*!< Response Ready. */
        };
        uint32_t reserved2[4];
    } resp;
    struct
    {
        uint64_t addr; /*!< Data. */
        uint32_t : 31;
        uint32_t en : 1; /*!< Enable entry. */
        uint32_t reserved[2];
        uint32_t siBitMap : 16; /*!< Station interfaces 15-0 for which this filter applies. */
        uint32_t : 16;
        uint32_t index : 16;  /*!< The index refers to an entry location within a table. */
        uint32_t length : 16; /*!< NA */
        uint32_t cmd : 8;     /*!< Command. */
        uint32_t class : 8;   /*!< Class of command. */
        uint32_t : 8;
        uint32_t status : 6; /*!< Status. */
        uint32_t ci : 1;     /*!< Completion interrupt. */
        uint32_t sf : 1;     /*!< Short format. */
    } generic;
} netc_cmd_bd_t;

/*! @brief Configuration for the Switch/SI command BD Ring Configuration */
typedef struct _netc_cmd_bdr_config
{
    netc_cmd_bd_t *bdBase; /*!< BDR base address which shall be 128 bytes aligned */
    uint16_t bdLength;     /*!< Size of BD ring which shall be multiple of 8 BD */
    bool enCompInt;        /*!< Enable/Disable command BD completion interrupt */
} netc_cmd_bdr_config_t;

/*! @brief The Switch/SI command BD ring handle data structure */
typedef struct _netc_cmd_bdr
{
    netc_cmd_bd_t *bdBase;  /*!< BDR base address which shall be 128 bytes aligned */
    uint16_t bdLength;      /*!< Size of BD ring */
    uint16_t producerIndex; /*!< Current index for execution. */
    uint16_t cleanIndex;    /*!< Current index for cleaning. */
    bool bdrEnable;         /*!< Current command BD ring is enable or not. */
} netc_cmd_bdr_t;

/*! @brief Table request data buffer common header */
typedef struct _netc_tb_common_header
{
    uint32_t updateActions : 16; /*!< Update Actions */
    uint32_t : 8;
    uint32_t queryActions : 4; /*!< Query Actions */
    uint32_t : 4;
} netc_tb_common_header_t;

/*!
 * @brief Frame Modification VLAN Update/Delete Action
 * @note  Misconfiguration error if replace or delete action is specified and if VLAN tag is not present in frame.
 */
typedef enum _netc_fm_vlan_ud_act
{
    kNETC_NoUDVlanAction = 0U, /*!< No Update/Delete VLAN action */
    kNETC_ReplVlanPcpAndDei, /*!< Replace outer VLAN's PCP/DEI based on the port's PPCPDEIMR. The tag's original VID and
                                TPID are preserved */
    kNETC_DelVlan            /*!< Delete outer VLAN Tag */

} netc_fm_vlan_ud_act_t;

/*!
 * @brief Frame Modification Sequence Tag Action
 * @note Must be set to 000b for Ingress frame modification, otherwise misconfiguration error..
 */
typedef enum _netc_fm_sqt_act
{
    kNETC_NoSqtAction = 0U, /*!< No SQT action */
    kNETC_ReomveRTag /*!< Remove R-TAG/draft 2.0 R-TAG/HSR tag, If R-TAG/HSR tag not present, misconfiguration error. */
} netc_fm_sqt_act_t;

/*!
 * @brief Frame Modification VLAN Add/Replace Action
 * @note  For ingress frame modificaion with 00b or 01b, use the ingress port to select PCP and DEI from the Bridge port
 *        default VLAN register (BPDVR). For egress frame modification with 00b or 01b, use the internal QoS associated
 *        with the frame (IPV, DR) to access the QoS to PCP mapping profile (PQOSMR[QVMP] , QOSVLANMPaR0/1/2/3) to set
 *        the new PCP value. Use internal DR associated with frame to access the DR to DEI mapping profile
 *        (PPCPDEIMR[DRnDEI]) to set the new DEI value.
 */
typedef enum _netc_fm_vlan_ar_act
{
    kNETC_AddCVlanPcpAndDei = 0U, /*!< Add outer VLAN with VID and PCP/DEI updated as described above. TPID=0x8100 */
    kNETC_AddSVlanPcpAndDei,      /*!< Add outer VLAN with VID and PCP/DEI updated as described above. TPID=0x88A8 */
    kNETC_ReplVidOnly,            /*!< Replace VLAN with VID. The tag's original PCP, DEI and TPID are preserved */
    kNETC_ReplVidPcpAndDei        /*!< Replace VLAN with VID and PCP/DEI updated by port's PPCPDEIMR. The tag's original
                                 TPID is preserved */

} netc_fm_vlan_ar_act_t;

/*!
 * @brief Frame Modification Entry ID encode options
 * @note sqta should be netc_fm_sqt_act_t type, vuda should be netc_fm_vlan_ud_act_t type and vara should be
 *       netc_fm_vlan_ar_act_t type.
 */
#define NETC_FD_EID_ENCODE_OPTION_0(entryId)    ((uint32_t)(entryId)&0xFFFU)
#define NETC_FD_EID_ENCODE_OPTION_1(sqta, vuda) ((((uint32_t)(sqta)&0x7U) << 2U) | ((uint32_t)(vuda)&0x3U) | 0x2000U)
#define NETC_FD_EID_ENCODE_OPTION_2(vara, vid)  ((((uint32_t)(vara)&0x3U) << 12U) | ((uint32_t)(vid)&0xFFFU) | 0x4000U)

