JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*!
 * @brief Define FDB/L2MCF/IS table entry access the primary Egress Treatment table entry group mode
 * @note  The FDB/L2 IPv4 Multicast filter table has precedence over any assignment made via the Ingress Stream table.
 *        For Mulit port mode, the index to access the Egress Treatment table is computed by adding an offset to the
 *        base index of the Egress Treatment group. That offset is derived from the applicability bitmap as follows:
 *        starting from the lowest significant bit of the bitmap, the first encountered bit set to 1, corresponds to
 *        offset 0, and so on. This continues till the destination port location in the bitmap is reached
 */
typedef enum _netc_tb_eteid_access_mode
{
    kNETC_NoETAccess = 0x0U,       /*!< No Egress Treatment table access */
    kNETC_SinglePortETAccess,      /*!< Only frame sent to a special port (define in ePort) can access a single Egress
                                    Treatment table entry, the applicability bitmap specified by FDB/L2MCF/IS ePort field
                                    */
    kNETC_MulitPortPackedETAccess, /*!< Only frames sent to a special set of ports (ports set to 1 in ePortBitmap) can
                                      access the Egress Treatment table, the applicability bitmap = IS ePortBitmap field
                                      or FDB/L2MCF portBitmap field */
    kNETC_MulitPortAbsETAccess     /*!< Frames sent to all of ports can access the Egress Treatment table, means the
                                      applicability bitmap is set with 1 for all ports */
} netc_tb_eteid_access_mode_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Ingress Port Filter Table
#endif

/*! @brief Ingress Port Filter Table Update Actions */
typedef enum _netc_tb_ipf_update_action
{
    kNETC_IPFCfgEUpdate = 0x1U, /*!< Configuration Element Update */
    kNETC_IPFStsEUpdate = 0x2U  /*!< Statistics Element Update */
} netc_tb_ipf_update_action_t;

/*! @brief Ingress Port Filter frame attribute mask */
typedef enum _netc_tb_ipf_attr_mask
{
    kNETC_IPFSwtPortMasMask = 0x1U,   /*!<  Switch port masquerading Mask */
    kNETC_IPFEthernetMask   = 0x2U,   /*!< Ethernet type Mask */
    kNETC_IPFOuterVlanMask  = 0x4U,   /*!< Outer VLAN Mask */
    kNETC_IPFInnerVlanMask  = 0x8U,   /*!< Inner VLAN Mask */
    kNETC_IPFSeqTagMask     = 0x70U,  /*!< Sequence Tag Code Mask */
    kNETC_IPFIpHeaderMask   = 0x80U,  /*!< IP Header Mask */
    kNETC_IPFIpVersionMask  = 0x100U, /*!< IP Version Mask */
    kNETC_IPFIpExtMask      = 0x200U, /*!< IPv4 option / IPv6 extension Mask */
    kNETC_IPFL4HeaderMask   = 0x400U, /*!< L4 Code Mask */
    kNETC_IPFWakeOnLanMask  = 0x800U  /*!< Wake-on-LAN Magic Packet Mask */
} netc_tb_ipf_attr_mask_t;

/*! @brief Ingress Port Filter frame attribute Sequence Tag Code */
typedef enum _netc_tb_ipf_seq_tag
{
    kNETC_IPFNoRtag = 0x0U, /*!<  R-TAG/HSR tag is not present */
    kNETC_IPFDraftRtag,     /*!< 802.1CB draft 2.0 R-TAG is present */
    kNETC_IPFRtag,          /*!< 802.1CB R-TAG is present */
    kNETC_IPFHsrTag         /*!< HSR Tag is present */
} netc_tb_ipf_seq_tag_t;

/*! @brief Ingress Port Filter frame attribute L4 Header Code */
typedef enum _netc_tb_ipf_l4_header
{
    kNETC_IPFOtherL4 =
        0x0U,     /*!< The L4 Header is considered as other L4 if it is not one of the following L4 Headers */
    kNETC_IPFTcp, /*!< TCP header is present */
    kNETC_IPFUdp, /*!< UDP header is present */
    kNETC_IPFSctp /*!< SCTP header is present */
} netc_tb_ipf_l4_header_t;

/*! @brief Ingress Port Filter key element */
typedef struct _netc_tb_ipf_keye
{
    uint16_t precedence; /*!< Precedence value of an entry*/
    uint8_t res0[6];
    struct
    {
        uint16_t swtPortMas : 1; /*!< Switch port masquerading, applicable only if the incoming port is designated
                                    as a switch management port */
        uint16_t ethernet : 1;   /*!< Ethernet type Present */
        uint16_t outerVlan : 1;  /*!< Outer VLAN Present */
        uint16_t innerVlan : 1;  /*!< Inner VLAN Present */
        netc_tb_ipf_seq_tag_t seqTag : 3;     /*!<  Sequence Tag Code */
        uint16_t ipHeader : 1;                /*!<  IP Header Present */
        uint16_t ipVersion : 1;               /*!< 0b = IPv4, 1b = IPv6 */
        uint16_t ipExt : 1;                   /*!< IPv4 option / IPv6 extension present */
        netc_tb_ipf_l4_header_t l4Header : 2; /*!< L4 Header code */
        uint16_t wakeOnLan : 1;               /*!< Wake-on-LAN Magic Packet Present */
        uint16_t : 3;
    } frameAttr;            /*!< Frame Attribute flags */
    uint16_t frameAttrMask; /*!< Frame attribute mask, set with OR of @ref netc_tb_ipf_attr_mask_t */
    uint16_t dscp : 6;      /*!< Differentiated Services Code Point */
    uint16_t dscpMask : 6;  /*!< Differentiated Services Code Point Mask */
    uint16_t res1 : 4;
    uint16_t srcPort : 5;     /*!< Source Port ID */
    uint16_t srcPortMask : 5; /*!< Source Port ID Mask */
    uint16_t res2 : 6;
    uint16_t outerVlanTCI;     /*!< Outer VLAN Tag Control Information */
    uint16_t outerVlanTCIMask; /*!< Outer VLAN Tag Control Information Mask */
    uint8_t dmac[6];           /*!< Destination MAC Address */
    uint8_t dmacMask[6];       /*!< Destination MAC Address Mask */
    uint8_t smac[6];           /*!< Source MAC Address */
    uint8_t smacMask[6];       /*!< Source MAC Address Mask */
    uint16_t innerVlanTCI;     /*!< Inner VLAN Tag Control Information */
    uint16_t innerVlanTCIMask; /*!< Inner VLAN Tag Control Information Mask */
    uint16_t etherType;        /*!< 2-byte EtherType */
    uint16_t etherTypeMask;    /*!< EtherType Mask */
    uint8_t IPProtocol;        /*!< IP Protocol */
    uint8_t IPProtocolMask;    /*!< IP Protocol Mask */
    uint8_t res3[14];
    uint8_t srcIPAddr[16]; /*!< IP Source Address, Bits 127-0: IPv6 source address, Bits 127-96: IPv4 source address */
    uint8_t res4[8];
    uint8_t srcIPAddrMask[16]; /*!< IP Source Address Mask */
    uint16_t l4SrcPort;        /*!< L4 Source Port */
    uint16_t l4SrcPortMask;    /*!< L4 Source Port Mask */
    uint8_t res5[4];
    uint8_t destIPAddr[16]; /*!< IP Destination Address, Bits 127-0: IPv6 source address, Bits 127-96: IPv4 source
                               address */
    uint8_t res6[8];
    uint8_t destIPAddrMask[16]; /*!< IP Destination Address Mask*/
    uint16_t l4DestPort;        /*!< L4 Destination Port */
    uint16_t l4DestPortMask;    /*!< L4 Destination Port Mask */
    uint8_t res7[4];
    struct
    {
        uint8_t data; /*!< Payload Byte n */
        uint8_t mask; /*!< Payload Byte n  Mask */
    } payload[24];
} netc_tb_ipf_keye_t;

/*! @brief Ingress port filter forwarding Action */
typedef enum _netc_tb_ipf_forward_action
{
    kNETC_IPFForwardDiscard = 0U, /*!< Frame be discard */
    kNETC_IPFForwardPermit,       /*!< Frame be permit */
    kNETC_IPFRedirectToMgmtPort,  /*!< Redirect frame to switch management port without any frame modification, Switch
                                    only */
    kNETC_IPFCopyToMgmtPort /*!< Copy frame to switch management port without any frame modification, Switch only */
} netc_tb_ipf_forward_action_t;

/*! @brief Ingress port filter Filter Action */
typedef enum _netc_tb_ipf_filter_action
{
    kNETC_IPFNoAction = 0U,     /*!< No action */
    kNETC_IPFWithRatePolicer,   /*!< Rate action with the Rate Policer Entry ID (RP_EID) set to the value configured in
                                   the fltaTgt field */
    kNETC_IPFWithIngressStream, /*!< Ingress stream identification action where the Ingress Stream Entry ID (IS_EID) is
                                   set to the value configured in the fltaTgt field */
    kNETC_IPFWithL2Filtering    /*!< Setting a pre L2 filtering SI bitmap (set to the value configured in the fltaTgt)
                                   that will be used by the L2 filtering function to determine the final SI bitmap, ENETC
                                   only */
} netc_tb_ipf_filter_action_t;

/*! @brief Ingress port filter config element */
typedef struct _netc_tb_ipf_cfge
{
    uint32_t ipv : 4;                       /*!< Internal Priority Value */
    uint32_t oipv : 1;                      /*!< Overwrite IPV */
    uint32_t dr : 2;                        /*!< Drop Resilience */
    uint32_t odr : 1;                       /*!< Overwrite DR */
    netc_tb_ipf_forward_action_t fltfa : 2; /*!< Filter Forwarding action. */
    uint32_t : 1;
    uint32_t imire : 1;                   /*!< Ingress Mirroring Enable */
    uint32_t wolte : 1;                   /*!< Wake-onLAN trigger enable */
    netc_tb_ipf_filter_action_t flta : 2; /*!< FIlter Action. */
    uint32_t rpr : 2;                     /*!< Relative Precedent Resolution */
    uint32_t ctd : 1;                     /*!< Cut through disable. */
    netc_host_reason_t hr : 4;            /*!< Host Reason metadata when frame is redirected/copied to
                                            the switch management port */
    uint32_t timecape : 1;                /*!< Timestam capture enable */
    uint32_t : 9;
    uint32_t fltaTgt; /*!< Target for selected switch forwarding action or filter action*/
} netc_tb_ipf_cfge_t;

