JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief Ingress port filter statistic element */
typedef struct _netc_tb_ipf_stse
{
    uint32_t matchCount[2]; /*!< A count of how many times this entry has been matched. */
} netc_tb_ipf_stse_t;

/*! @brief Ingress port filter table entry config */
typedef struct _netc_tb_ipf_req_data
{
    netc_tb_common_header_t commonHeader;
    union
    {
        netc_tb_ipf_keye_t keye;
        uint32_t entryID;
        uint32_t sCriteria;
    };
    netc_tb_ipf_cfge_t cfge;
} netc_tb_ipf_req_data_t;

/*! @brief Ingress port filter table response data */
typedef struct _netc_tb_ipf_rsp_data
{
    uint32_t status;
    uint32_t entryID;        /*!< Present only for commands which perform a query */
    netc_tb_ipf_keye_t keye; /*!< Present only for commands which perform a query */
    netc_tb_ipf_stse_t stse; /*!< Present only for commands which perform a query */
    netc_tb_ipf_cfge_t cfge; /*!< Present only for commands which perform a query */
} netc_tb_ipf_rsp_data_t;

/*! @brief Ingress Port filter table data buffer */
typedef struct _netc_tb_ipf_data
{
    union
    {
        netc_tb_ipf_req_data_t request;
        netc_tb_ipf_rsp_data_t response;
    };
} netc_tb_ipf_data_t;

/*! @brief Ingress Port filter entry config */
typedef struct _netc_tb_ipf_config
{
    netc_tb_ipf_keye_t keye;
    netc_tb_ipf_cfge_t cfge;
} netc_tb_ipf_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Ingress Port Filter Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Ingress Stream Identification Table
#endif

/*! @brief 2 Bytes VLAN field which may added to the frame Key */
#define NETC_ISI_VLAN_FRAME_KEY(valid, pcp, vid) \
    (((uint16_t)((valid)&0x1) << 15U) | ((uint16_t)((pcp)&0x3) << 12U) | ((uint16_t)(vid)&0xFFFU))

/*! @brief Stream identification table key type */
typedef enum _netc_tb_isi_key_type
{
    kNETC_KCRule0 = 0U, /*!< Use key construction rule 0 (ISIDKC0CR0) */
    kNETC_KCRule1,      /*!< Use key construction rule 1 (ISIDKC1CR0) */
    kNETC_KCRule2,      /*!< Use key construction rule 2 (ISIDKC2CR0). Only for SWITCH */
    kNETC_KCRule3       /*!< Use key construction rule 3 (ISIDKC3CR0). Only for SWITCH */
} netc_tb_isi_key_type;

/*! @brief Stream identification table key element */
typedef struct _netc_tb_isi_keye
{
    netc_tb_isi_key_type keyType : 2; /*!< Define the key type used for the current isi entry */
    uint8_t srcPortID : 5;            /*!< Source Port ID, used when kc portp filed is 1. Only for SWITCH */
    uint8_t spm : 1;                  /*!< Source Port Masquerading, used when kc spm filed is 1. Only for SWITCH */
    uint8_t res0[3];
    uint8_t framekey[16]; /*!< Frame portion of the key. */
} netc_tb_isi_keye_t;

/*! @brief Stream identification table config element */
typedef struct _netc_tb_isi_cfge
{
    uint32_t iSEID; /*!< Ingress stream entry ID, 0xFFFFFFFF means NULL */
} netc_tb_isi_cfge_t;

/*! @brief Stream identification table request data buffer */
typedef struct _netc_tb_isi_req_data
{
    netc_tb_common_header_t commonHeader;
    union
    {
        uint32_t entryID;
        uint32_t sCriteria;
        netc_tb_isi_keye_t keye;
    };
    netc_tb_isi_cfge_t cfge;
} netc_tb_isi_req_data_t;

/*! @brief Stream identification table request response data buffer */
typedef struct _netc_tb_isi_rsp_data
{
    uint32_t status;
    uint32_t entryID;        /*!< Only present for query command */
    netc_tb_isi_keye_t keye; /*!< Only present for query command */
    netc_tb_isi_cfge_t cfge; /*!< Only present for query command */
} netc_tb_isi_rsp_data_t;

/*! @brief Stream identification table data buffer */
typedef struct _netc_tb_isi_data
{
    union
    {
        netc_tb_isi_req_data_t request;
        netc_tb_isi_rsp_data_t response;
    };
} netc_tb_isi_data_t;

/*! @brief Stream identification table entry config */
typedef struct _netc_tb_isi_config
{
    netc_tb_isi_keye_t keye;
    netc_tb_isi_cfge_t cfge;
} netc_tb_isi_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Ingress Stream Identification Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Ingress Stream Table
#endif

/*! @brief Ingress Stream table Ingress Sequence Action */
typedef enum _netc_tb_is_isq_action
{
    kNETC_ISNotPerformFRER = 0, /*!< Not perform Frame FRER sequence generation function */
    kNETC_ISPerformFRER         /*!< Perform Frame FRER sequence generation function */
} netc_tb_is_isq_action_t;

/*! @brief Ingress Stream table forwarding Action */
typedef enum _netc_tb_is_forward_action
{
    kNETC_ISDiscard            = 0U, /*!< Frame be discard */
    kNETC_ISRedirectToMgmtPort = 1U, /*!< Frame be Re-direct frame to switch management port, Switch only */
    kNETC_ISAllow              = 1U, /*!< Frame is allow without setting the pre L2 filtering SI bitmap, ENETC only */
    kNETC_ISAllowWithSIMap = 2U, /*!< Frame is allow with setting the pre L2 filtering SI bitmap to the value configured
                                    in the SI_MAP field, ENETC only */
    kNETC_ISStreamForward = 2U,  /*!< Frame is forwarded to the port(s) specified in the EGRESS_PORT_BITMAP field,
                                         Switch only */
    kNETC_ISBridgeForward, /*!< Frame is do 802.1Q Bridge forwarding (VLAN processing and L2 forwarding), Switch only */
    kNETC_ISCopyToMgmtPortAndStream, /*!< Copy frame to switch management port with specified HR and stream forwarding,
                                        Switch only */
    kNETC_ISCopyToMgmtPortAndBridge  /*!< Copy frame to switch management port with specified HR and Bridge forwarding,
                                        Switch only */
} netc_tb_is_forward_action_t;

/*! @brief Ingress Stream table Cut-Through Disable mode */
typedef enum _netc_tb_is_ctd_mode
{
    kNETC_ISNoCTD = 0x0U,  /*!< Do not override cut-through state */
    kNETC_ISSinglePortCTD, /*!< Disable cut-through for the outgoing port specified in the cfge ePort field */
    kNETC_ISAllPortCTD     /*!< Disable cut-through for all ports specified in cfge portBitmap field */
} netc_tb_is_ctd_mode_t;

/*! @brief Ingress Stream table Override ET_EID mode */
typedef netc_tb_eteid_access_mode_t netc_tb_is_oeteid_mode_t;

/*! @brief Ingress Stream table config element */
typedef struct _netc_tb_is_cfge
{
    uint32_t sfe : 1; /*!< Stream Filtering Enable */
    uint32_t : 3;
    uint32_t ipv : 4;      /*!< Internal Priority Value, active when opiv is set to 1 */
    uint32_t oipv : 1;     /*!< Override internal priority value */
    uint32_t dr : 2;       /*!< Drop Resilience, active when odr is set to 1 */
    uint32_t odr : 1;      /*!< Overwrite DR */
    uint32_t imire : 1;    /*!< Ingress Mirroring Enable, not applicable to ENETC */
    uint32_t timecape : 1; /*!< Timestamp Capture Enable, not applicable to ENETC */
    uint32_t : 1;
    uint32_t sppd : 1;                /*!< Source Port Pruning Disable, not applicable to ENETC */
    netc_tb_is_isq_action_t isqa : 2; /*!< Ingress Sequence Action, not applicable to ENETC */
    uint32_t orp : 1;                 /*!< Override Rate Policer ID */
    uint32_t osgi : 1;                /*!< Override stream gate instance entry id (default is NULL) */
    netc_host_reason_t hr : 4; /*!< Host Reason when frame is redirected (fa = 01b) to the switch management port or
                        copied to the switch management port (fa = 100b or 101b), value specified has to be a software
                        defined Host Reason (8-15). */
    netc_tb_is_forward_action_t fa : 3; /*!< Forwad Option */
    netc_tc_sdu_type_t sduType : 2;     /*!< Service Data Unit Type to user for MSDU */
    uint32_t : 3;
    uint32_t msdu : 16;         /*!< Maximum Service Data Unit */
    uint32_t ifmeLenChange : 7; /*!< Ingress Frame Modification Entry Frame Length Change, specified in unit of bytes
                                   using a 2's complement notation */
    uint32_t eport : 5; /*!< Egress Port which need do egress packet processing, active when oeteid is set to 1, not
                           applicable to ENETC */
    netc_tb_is_oeteid_mode_t oETEID : 2; /*!< Override ET_EID (Egress Treatment table entry, which specified egress
                            packet processing actions) */
    netc_tb_is_ctd_mode_t ctd : 2;       /*!< Cut-Through Disable mode, valid if fa = 010b ~ 101b */
    uint32_t isqEID; /*!< Ingress Sequence Generation Entry ID, Valid when isqa is set to 1. 0xFFFF_FFFF is NULL. Not
                        applicable to ENETC */
    uint32_t rpEID;  /*!< Rate Policer Entry ID, Valid when orp =1. 0xFFFF_FFFF is NULL */
    uint32_t sgiEID; /*!< Stream Gate Instance Entry ID, Valid when osgi =1. 0xFFFF_FFFF is NULL */
    uint32_t ifmEID; /*!< Ingress Frame Modification Entry ID. 0xFFFF_FFFF is NULL */
    uint32_t etEID;  /*!< Base Egress Treatment Entry ID for primary Egress Treatment group, Valid alid if fa = 010b ~
                        101b.  0xFFFF_FFFF is NULL. Not applicable  to ENETC */
    uint32_t iscEID; /*!< Ingress Stream counter Index. 0xFFFF_FFFF is NULL. */
    uint32_t ePortBitmap; /*!< Egress Port bitmap, identifies the ports to which the frame is to be forwarding or
                                  ET applicability port bitmap when oETEID = 10b. Not applicable to ENETC */
    uint32_t : 8;
    uint32_t siMap : 16; /*!< Station Interface Map, only valid for ENETC function when fa field is set to 10b */
    uint32_t : 16;
} netc_tb_is_cfge_t;

