JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief Frame Modification table request data buffer */
typedef struct _netc_tb_fm_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_fm_cfge_t cfge;
} netc_tb_fm_req_data_t;

/*! @brief Frame Modification table request response data buffer */
typedef struct _netc_tb_fm_rsp_data
{
    uint32_t entryID;
    netc_tb_fm_cfge_t cfge;
} netc_tb_fm_rsp_data_t;

/*! @brief Frame Modification table data buffer */
typedef struct _netc_tb_fm_data
{
    union
    {
        netc_tb_fm_req_data_t request;
        netc_tb_fm_rsp_data_t response;
    };
} netc_tb_fm_data_t;

/*! @brief Frame Modification table entry config */
typedef struct _netc_tb_fm_config
{
    uint32_t entryID;
    netc_tb_fm_cfge_t cfge;
} netc_tb_fm_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Frame Modification DataTable
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Frame Modification Data Table
#endif
/*! @brief TFrame Modification Data table update config Data Buffer length, x is the number of update data bytes */
#define NETC_TB_FMD_UPDATE_CONFIG_LENGTH(x) (8U + (x))

/*! @brief Frame Modification Data table request data buffer */
typedef struct _netc_tb_fmd_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    uint8_t cfge[]; /*!< Configuration Element Data size is variable */
} netc_tb_fmd_req_data_t;

/*! @brief Frame Modification Data table request response data buffer */
typedef struct _netc_tb_fmd_rsp_data
{
    uint32_t entryID;
    uint8_t cfge[]; /*!< Configuration Element Data size is variable */
} netc_tb_fmd_rsp_data_t;

/*! @brief Frame Modification Data table data buffer */
typedef struct _netc_tb_fmd_data
{
    union
    {
        netc_tb_fmd_req_data_t request;
        netc_tb_fmd_rsp_data_t response;
    };
} netc_tb_fmd_data_t;

/*! @brief Frame Modification data table entry update config */
typedef struct _netc_tb_fmd_update_config
{
    uint32_t res; /*!< Hold for request->commonHeader */
    uint32_t entryID;
    uint8_t cfge[]; /*!< Configuration Element Data size is variable */
} netc_tb_fmd_update_config_t;

/*! @brief Frame Modification data table entry query data buffer */
typedef struct _netc_tb_fmd_query_buffer
{
    uint32_t entryID; /*!< EntryID of the queried entry */
    uint8_t cfge[];   /*!< Configuration Element Data size is variable */
} netc_tb_fmd_query_buffer_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Frame Modification Data Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Vlan Filter Table
#endif

/*! @brief Vlan Filter table key element */
typedef struct _netc_tb_vf_keye
{
    uint32_t vid : 12;
    uint32_t : 20;
} netc_tb_vf_keye_t;

/*! @brief Vlan Filter table config element */
typedef struct _netc_tb_vf_cfge
{
    uint32_t portMembership : 24; /*!< Port Membership Bitmap */
    uint32_t stgID : 4;           /*!< Spanning Tree Group Member ID */
    uint32_t : 4;
    uint32_t fid : 12; /*!< Filtering ID */
    uint32_t : 4;
    uint32_t mlo : 3; /*!< MAC Learning Options */
    uint32_t mfo : 2; /*!< MAC Forwarding Options */
    uint32_t : 1;
    uint32_t ipmfe : 1;  /*!< IP Multicast Filtering Enable */
    uint32_t ipmfle : 1; /*!< IP Multicast Flooding Enable */
    uint32_t : 8;
    uint32_t etaPortBitmap : 24; /*!< Egress Treatment Applicability Port Bitmap for the secondary
                                    Egress Treatment group */
    uint32_t : 8;
    uint32_t baseETEID; /*!< Base Egress Treatment Entry ID for the secondary Egress Treatment group */
} netc_tb_vf_cfge_t;

/*! @brief Vlan Filter table request data buffer */
typedef struct _netc_tb_vf_req_data
{
    netc_tb_common_header_t commonHeader;
    union
    {
        uint32_t entryID;
        uint32_t sCriteria; /*!< Resume Entry ID, when starting a search, pass the NULL Entry ID. */
        netc_tb_vf_keye_t keye;
    };
    netc_tb_vf_cfge_t cfge; /*!< Present only for update or add commands */
} netc_tb_vf_req_data_t;

/*! @brief Vlan Filter table request response data buffer */
typedef struct _netc_tb_vf_rsp_data
{
    uint32_t status;        /*!< Present only for query command with search access method */
    uint32_t entryID;       /*!< Present only for query command */
    netc_tb_vf_keye_t keye; /*!< Present only for query command */
    netc_tb_vf_cfge_t cfge; /*!< Present only for query command */
} netc_tb_vf_rsp_data_t;

/*! @brief Vlan Filter table data buffer */
typedef struct _netc_tb_vf_data
{
    union
    {
        netc_tb_vf_req_data_t request;
        netc_tb_vf_rsp_data_t response;
    };
} netc_tb_vf_data_t;

/*! @brief Vlan Filter table entry config */
typedef struct _netc_tb_vf_config
{
    netc_tb_vf_keye_t keye;
    netc_tb_vf_cfge_t cfge;
} netc_tb_vf_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Vlan Filter Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region FDB Table
#endif

/*! @brief FDB table Update Actions */
typedef enum _netc_tb_fdb_update_action
{
    kNETC_FDBCfgEUpdate = 0x1U, /*!< Configuration Element Update */
    kNETC_FDBActEUpdate = 0x2U  /*!< Activity Element Update */
} netc_tb_fdb_update_action_t;

/*! @brief FDB table entry defined the egress packet processing actions (will cover the actions which specified in the
 * Egress Treatment table )*/
typedef netc_tb_eteid_access_mode_t netc_tb_fdb_oeteid_mode_t;

/*! @brief FDB table Cut-Through Disable mode */
typedef enum _netc_tb_fdb_ctd_mode
{
    kNETC_FDBNoCTD         = 0x0U, /*!< Do not override cut-through state */
    kNETC_FDBSinglePortCTD = 0x1U, /*!< Disable cut-through for the outgoing port specified in the cfge ePort field */
    kNETC_FDBAllPortCTD    = 0x2U  /*!< Disable cut-through for all ports specified in cfge portBitmap field */
} netc_tb_fdb_ctd_mode_t;

typedef struct _netc_tb_fdb_keye
{
    uint8_t macAddr[6]; /*!< Destination MAC address of the frame for MAC forwarding lookups and the source MAC address
                           of the frame for MAC learning lookups */
    uint8_t res0[2];
    uint32_t fid : 12; /*!< Filtering ID, is obtained from an ingress lookup into the VLAN Filter table */
    uint32_t : 20;
} netc_tb_fdb_keye_t;

