JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief L2 IPV4 Multicast Filter table search criteria Key Element Match Criteria */
typedef enum _etc_tb_l2mcf_sc_keye_mc
{
    kNETC_L2MCFKeyeMacthAny = 0x0, /*!< Match any Key Element Criteria */
    kNETC_L2MCFKeyeMacthFID = 0x1  /*!< Match Key Element FID */
} etc_tb_l2mcf_sc_keye_mc_t;

/*! @brief L2 IPV4 Multicast Filter table search criteria Configuration Element Match Criteria */
typedef enum _etc_tb_l2mcf_sc_cfge_mc
{
    kNETC_L2MCFCfgeMacthAny        = 0x0, /*!< Match any Configuration Element Criteria */
    kNETC_L2MCFCfgeMacthDynamic    = 0x1, /*!< Match Configuration Element dynamic field */
    kNETC_L2MCFCfgeMacthPortBitmap = 0x2, /*!< Match Configuration Element portBitmap field */
    kNETC_L2MCFCfgeMacthBoth       = 0x3  /*!< Match both dynamic field and portBitmap */
} etc_tb_l2mcf_sc_cfge_mc_t;

/*! @brief FDB table search criteria Activity Element Match Criteria */
typedef enum _etc_tb_l2mcf_sc_acte_mc
{
    kNETC_L2MCFActeMacthAny   = 0x0, /*!< Match any Activity Element Criteria */
    kNETC_L2MCFActeMatchExact = 0x1  /*!<  Exact match with Activity Element */
} etc_tb_l2mcf_sc_acte_mc_t;

/*! @brief L2 IPV4 Multicast Filter table config element */
typedef netc_tb_fdb_cfge_t netc_tb_l2mcf_cfge_t;

/*! @brief L2 IPV4 Multicast Filter table activity lement */
typedef netc_tb_fdb_acte_t netc_tb_l2mcf_acte_t;

/*! @brief L2 IPV4 Multicast Filter table search criteria format */
typedef struct _etc_tb_l2mcf_search_criteria
{
    uint32_t resumeEntryId;    /*!< Resume Entry ID, pass the NULL Entry ID when starting a search */
    netc_tb_l2mcf_keye_t keye; /*!< Key Element data which used to match against the table entries */
    netc_tb_l2mcf_cfge_t cfge; /*!< Configuration Element data which used to match against the table entries */
    struct
    {
        netc_tb_l2mcf_acte_t acte; /*!< Activity Element data which used to match against the table entries */
        etc_tb_l2mcf_sc_keye_mc_t keyeMc : 1; /*!< Key Element data match criteria */
        uint8_t : 7;
        etc_tb_l2mcf_sc_cfge_mc_t cfgeMc : 3; /*!< Configuration Element data match criteria */
        uint8_t : 5;
        etc_tb_l2mcf_sc_acte_mc_t acteMc : 1; /*!< Activity Element data match criteria */
        uint8_t : 7;
    };
} netc_tb_l2mcf_search_criteria_t;

/*! @brief L2 IPV4 Multicast Filter table request data buffer */
typedef struct _netc_tb_l2mcf_req_data
{
    netc_tb_common_header_t commonHeader;
    union
    {
        uint32_t entryID;
        netc_tb_l2mcf_search_criteria_t sCriteria;
        netc_tb_l2mcf_keye_t keye;
    };
    netc_tb_l2mcf_cfge_t cfge;
} netc_tb_l2mcf_req_data_t;

/*! @brief L2 IPV4 Multicast Filter table request response data buffer */
typedef struct _netc_tb_l2mcf_rsp_data
{
    uint32_t status;
    uint32_t entryID;
    netc_tb_l2mcf_keye_t keye;
    netc_tb_l2mcf_cfge_t cfge;
    netc_tb_l2mcf_acte_t acte;
} netc_tb_l2mcf_rsp_data_t;

/*! @brief L2 IPV4 Multicast Filter table data buffer */
typedef struct _netc_tb_l2mcf_data
{
    union
    {
        netc_tb_l2mcf_req_data_t request;
        netc_tb_l2mcf_rsp_data_t response;
    };
} netc_tb_l2mcf_data_t;

/*! @brief L2 IPV4 Multicast Filter table entry config */
typedef struct _netc_tb_l2mcf_config
{
    netc_tb_l2mcf_keye_t keye;
    netc_tb_l2mcf_cfge_t cfge;
} netc_tb_l2mcf_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion L2 IPV4 Multicast Filter Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Ingress Sequence Generation Table
#endif

/*! @brief Sequence Tag Type */
typedef enum _netc_tb_iseqg_sqtag
{
    kNETC_SqDraftRTag = 1U, /*!< 802.1CB draft 2.0 R-TAG. */
    kNETC_SqRTag,           /*!< 802.1CB R-TAG. */
    kNETC_SqHsrTag,         /*!< HSR Tag. */
} netc_tb_iseqg_sqtag_t;

/*! @brief Ingress Sequence Generation table config element */
typedef struct _netc_tb_iseqg_cfge
{
    netc_tb_iseqg_sqtag_t sqTag : 3; /*!< Sequence Tag Type. */
    uint8_t : 5;                     /*!< Reserved. */
} netc_tb_iseqg_cfge_t;

/*! @brief Ingress Sequence Generation table Sequence generation state element */
typedef struct _netc_tb_iseqg_sgse
{
    uint16_t sqgNum; /*!< Sequence Generation Number */
} netc_tb_iseqg_sgse_t;

/*! @brief Ingress Sequence Generation table request data buffer */
typedef struct _netc_tb_iseqg_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_iseqg_cfge_t cfge;
} netc_tb_iseqg_req_data_t;

/*! @brief Ingress Sequence Generation table request response data buffer */
typedef struct _netc_tb_iseqg_rsp_data
{
    uint32_t entryID;
    netc_tb_iseqg_cfge_t cfge;
    uint8_t : 8;
    netc_tb_iseqg_sgse_t sgse;
} netc_tb_iseqg_rsp_data_t;

/*! @brief Ingress Sequence Generation table data buffer */
typedef struct _netc_tb_iseqg_data
{
    union
    {
        netc_tb_iseqg_req_data_t request;
        netc_tb_iseqg_rsp_data_t response;
    };
} netc_tb_iseqg_data_t;

/*! @brief Ingress Sequence Generation table entry config */
typedef struct _netc_tb_iseqg_config
{
    uint32_t entryID;
    netc_tb_iseqg_cfge_t cfge;
} netc_tb_iseqg_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Ingress Sequence Generation Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Egress Sequence Recovery Table
#endif
/*! @brief Egress Sequence Recovery table Sequence Tag Type */
typedef enum _netc_tb_eseqr_sqtag
{
    kNETC_AcceptAnyTag    = 0U, /*!< Accept any incoming tag type (802.1CB draft 2.0 R-TAG, 802.1CB R-TAG or HSR Tag) */
    kNETC_AcceptDraftRTag = 1U, /*!< 802.1CB draft 2.0 R-TAG. */
    kNETC_AcceptRTag,           /*!< 802.1CB R-TAG. */
    kNETC_AcceptHsrTag,         /*!< HSR Tag. */
} netc_tb_eseqr_sqtag_t;

/*! @brief Egress Sequence Recovery table config element */
typedef struct _netc_tb_eseqr_cfge
{
    netc_tb_eseqr_sqtag_t sqTag : 3; /*!< Sequence Tag, specify the expected sequence tag type in the frame */
    uint32_t sqrTnsq : 1;            /*!< Sequence Recovery Take No Sequence */
    uint32_t sqrAlg : 1;             /*!< Sequence Recovery Algorithm, 0b = Vector algorithm, 1b = Match algorithm */
    uint32_t sqrType : 1; /*!< Sequence Recovery Function type, 0b = Sequence recovery function, 1b = Individual
                             recovery function */
    uint32_t : 2;
    uint32_t sqrHl : 7; /*!< Sequence Recovery History Length, valid if sqrAlg = 0b */
    uint32_t : 1;
    uint32_t sqrFwl : 12; /*!< Sequence Recovery Future Window Length, valid if sqrAlg = 0b */
    uint32_t : 4;
    uint32_t sqrTp : 12; /*!< Sequence Timeout Period, the unit is 1.048576 milliseconds */
    uint32_t : 20;
} netc_tb_eseqr_cfge_t;

/*! @brief Egress Sequence Recovery table statistic element */
typedef struct _netc_tb_eseqr_stse
{
    uint32_t inOrderPackets[2];    /*!< In Order Packets */
    uint32_t outOfOrderPackets[2]; /*!< Out of Order Packets */
    uint32_t roguePackets[2];      /*!< Rogue Packets */
    uint32_t duplicatePackets[2];  /*!< Duplicate Packets */
    uint32_t lostPackets[2];       /*!< Lost Packets */
    uint32_t taglessPackets[2];    /*!< Tag-Less Packets */
    uint32_t esqrResetCounts;      /*!< Sequence Recovery Resets */
} netc_tb_eseqr_stse_t;

/*! @brief Egress Sequence Recovery table sequence recovery state element */
typedef struct _netc_tb_eseqr_srse
{
    uint32_t sqrNum : 16; /*!< Sequence Recovery Number */
    uint32_t takeAny : 1; /*!< Take Any */
    uint32_t lce : 1;     /*!< Lost Count Enable */
    uint32_t sqrTs : 12;  /*!< Sequence Recovery Timestamp */
    uint32_t : 2;
    uint32_t sqrHistory[4]; /*!< Recovery History bit vector, each bit corresponding to sequence numbers, bit 1 means a
                               packet with that sequence number has been previously received */
} netc_tb_eseqr_srse_t;

/*! @brief Egress Sequence Recovery table request data buffer */
typedef struct _netc_tb_eseqr_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_eseqr_cfge_t cfge;
} netc_tb_eseqr_req_data_t;

/*! @brief Egress Sequence Recovery table request response data buffer */
typedef struct _netc_tb_eseqr_rsp_data
{
    uint32_t entryID;
    netc_tb_eseqr_stse_t stse;
    netc_tb_eseqr_cfge_t cfge;
    netc_tb_eseqr_srse_t srse;
} netc_tb_eseqr_rsp_data_t;

/*! @brief Egress Sequence Recovery table data buffer */
typedef struct _netc_tb_eseqr_data
{
    union
    {
        netc_tb_eseqr_req_data_t request;
        netc_tb_eseqr_rsp_data_t response;
    };
} netc_tb_eseqr_data_t;

/*! @brief Egress Sequence Recovery table entry config */
typedef struct _netc_tb_eseqr_config
{
    uint32_t entryID;
    netc_tb_eseqr_cfge_t cfge;
} netc_tb_eseqr_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Egress Sequence Recovery Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Time Gate Scheduling Table
#endif

/*! @brief Time Gate Scheduling Table maximum gate control list length (TGSTCAPR[MAX_GCL_LEN]) */
#define NETC_TB_TGS_MAX_ENTRY (0x100U)

/*! @brief Time Gate Scheduling table entry ID for switch and ENETC */
typedef enum _netc_tb_tgs_entry_id
{
    kNETC_TGSSwtPort0 = 0U, /*!< Switch PORT 0 entry ID */
    kNETC_TGSSwtPort1,      /*!< Switch PORT 1 entry ID */
    kNETC_TGSSwtPort2,      /*!< Switch PORT 2 entry ID */
    kNETC_TGSSwtPort3,      /*!< Switch PORT 3 entry ID */
    kNETC_TGSSwtPort4,      /*!< Switch PORT 4 entry ID */
    kNETC_TGSEnetc0Port,    /*!< ENETC 0 port entry ID */
    kNETC_TGSEnetc1Port     /*!< ENETC 1 port entry ID */
} netc_tb_tgs_entry_id_t;

/*! @brief Administrative gate operation type */
typedef enum _netc_tb_tgs_gate_type
{
    kNETC_SetGateStates = 0U, /*!< HoldRequest is unchanged */
    kNETC_SetAndHoldMac,      /*!< HoldRequest is set to value hold, only active when enable preemption */
    kNETC_SetAndReleaseMac    /*!< HoldRequest is set to value release, only active when enable preemption */
} netc_tb_tgs_gate_type_t;

/*! @brief Defines the Time Gate Scheduling gate control entry structure. */
typedef struct _netc_tgs_gate_entry
{
    uint32_t interval; /*!< Entry Time Interval */
    union
    {
        struct
        {
            uint32_t tcGateState : 8; /*!< Traffic Class Gate States for Gate Entry, 8 bits for 8 Traffic
                                           Class , 0b means Gate closed, 1b means Gate open */
            uint32_t : 8;
            netc_tb_tgs_gate_type_t operType : 4; /*!< Gate operation type ( IEEE 802.1Q-2018) field for gate
                                                    control list entry i */
            uint32_t : 12;
        };
        uint32_t gate; /*!< Entry Gate Mask*/
    };
} netc_tgs_gate_entry_t;

