JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief Time Gate Scheduling table config element */
typedef struct _netc_tb_tgs_cfge
{
    uint64_t adminBaseTime;           /*!< Administrative Base Time */
    uint32_t adminCycleTime;          /*!< Administrative Cycle Time */
    uint32_t adminCycleTimeExt;       /*!< Administrative Cycle Time Extension */
    uint32_t adminControlListLength;  /*!< Administrative Control List Length */
    netc_tgs_gate_entry_t adminGcl[]; /*!< Administrative Gate control list */
} netc_tb_tgs_cfge_t;

/*! @brief Time Gate Scheduling table statistic element */
typedef struct _netc_tb_tgs_olse
{
    uint64_t configChangeTime;       /*!< The time at which this operational gate control list became active */
    uint64_t configChangeError;      /*!< Count of error configuration changes */
    uint64_t operBaseTime;           /*!< Operational Base Time */
    uint32_t operCycleTime;          /*!< Operational Cycle Time */
    uint32_t operCycleTimeExt;       /*!< Operational Cycle Time Extension */
    uint32_t operControlListLength;  /*!< Operational Control List Length */
    netc_tgs_gate_entry_t operGcl[]; /*!< Operational Gate control list */
} netc_tb_tgs_olse_t;

/*! @brief Time Gate Scheduling table request data buffer */
typedef struct _netc_tb_tgs_req_data
{
    netc_tb_common_header_t commonHeader;
    netc_tb_tgs_entry_id_t entryID;
    netc_tb_tgs_cfge_t cfge; /*!< Present only for commands which perform a update */
} netc_tb_tgs_req_data_t;

/*! @brief Time Gate Scheduling table request response data buffer */
typedef struct _netc_tb_tgs_rsp_data
{
    uint64_t configChangeTime;
    uint32_t res0;
    uint32_t entryID;        /*!< Present only for commands which perform a query */
    netc_tb_tgs_cfge_t cfge; /*!< Present only for commands which perform a query */
    netc_tb_tgs_olse_t olse; /*!< Present only for commands which perform a query */
} netc_tb_tgs_rsp_data_t;

/*! @brief Time Gate Scheduling table data buffer, set with max size */
typedef struct _netc_tb_tgs_data
{
    union
    {
        netc_tb_tgs_req_data_t request;
        netc_tb_tgs_rsp_data_t response;
        struct
        {
            uint32_t rel0[18];
            netc_tgs_gate_entry_t res1[NETC_TB_TGS_MAX_ENTRY];
        };
    };
} netc_tb_tgs_data_t;

/*! @brief Time Gate Scheduling table entry gate control list structure */
typedef struct _netc_tb_tgs_gcl
{
    netc_tb_tgs_entry_id_t entryID;
    uint64_t baseTime;             /*!< Base Time */
    uint32_t cycleTime;            /*!< Cycle Time */
    uint32_t extTime;              /*!< Cycle Time Extension */
    uint32_t numEntries;           /*!< Control List entry numbers */
    netc_tgs_gate_entry_t *gcList; /*!< Pointer to time gate control list array */
} netc_tb_tgs_gcl_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Time Gate Scheduling Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region Egress Treatment Table
#endif
/*! @brief Egress Frame Modification entry mode */
typedef enum _netc_tb_et_efm_mode
{
    kNETC_NormalMode = 0U, /*!< Egress Frame Modification entry use normal/Default mode */
    kNETC_L2Act1,          /*!< Egress Frame Modification entry l2Act = kNETC_UseSpecPlayload */
    kNETC_PldAct1          /*!< Egress Frame Modification entry pldAct = kNETC_ReplAllEthPld */
} netc_tb_et_efm_mode_t;

/*! @brief Egress Sequence Actions */
typedef enum _netc_tb_et_esq_act
{
    kNETC_NoEsqAction  = 0U, /*!< No Egress Sequence Action required */
    kNETC_HasEsqAction = 2U, /*!< Has Egress Sequence Recovery action */
} netc_tb_et_esq_act_t;

/*! @brief Egress Counter Action */
typedef enum _netc_tb_et_ec_act
{
    kNETC_NoEcCounter = 0U, /*!< Do not increment egress frame counter */
    kNETC_HasEcCounter      /*!< Increment egress frame counter */
} netc_tb_et_ec_act_t;

/*! @brief Egress Treatment table config element */
typedef struct _netc_tb_et_cfge
{
    netc_tb_et_efm_mode_t efmMode : 2; /*!< Egress Frame Modification mode */
    uint8_t : 2;
    netc_tb_et_esq_act_t esqa : 2; /*!< Egress Sequence Actions */
    netc_tb_et_ec_act_t eca : 2;   /*!< Egress Counter Action */
    uint8_t : 1;                   /*!< Reserve for data align */
    uint8_t efmLenChange : 7;      /*!< Egress Frame Modification Length Change, specified in units of bytes using a 2's
                                       complement notation */
    uint16_t efmDataLen : 11;      /*!< Egress Frame Modification Data Length */
    uint16_t : 5;
    uint32_t efmEID;     /*!< Egress Frame Modification Entry Id */
    uint32_t ecEID;      /*!< Egress Count Table Entry ID */
    uint32_t esqaTgtEID; /*!< Egress Sequence Actions Target Entry ID, active when esqa = 10b */
} netc_tb_et_cfge_t;

/*! @brief Egress Treatment table request data buffer */
typedef struct _netc_tb_et_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_et_cfge_t cfge;
} netc_tb_et_req_data_t;

/*! @brief Egress Treatment table request response data buffer */
typedef struct _netc_tb_et_rsp_data
{
    uint32_t entryID;
    netc_tb_et_cfge_t cfge;
} netc_tb_et_rsp_data_t;

/*! @brief Egress Treatment table data buffer */
typedef struct _netc_tb_et_data
{
    union
    {
        netc_tb_et_req_data_t request;
        netc_tb_et_rsp_data_t response;
    };
} netc_tb_et_data_t;

/*! @brief Egress Treatment table entry config */
typedef struct _netc_tb_et_config
{
    uint32_t entryID;
    netc_tb_et_cfge_t cfge;
} netc_tb_et_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Egress Treatment Table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region ETM Class Queue Table
#endif
/*! @brief ETM Class Queue table entry ID macro, cqID is represents the Class Queue ID ,rang in 0 ~ 7, portID is Switch
 * ID, rang in 0 ~ 4 */
#define NETC_TB_ETM_CQ_ENTRY_ID(portID, cqID) (((uint32_t)(portID) << 4U) | ((cqID)&0x7U))

/*! @brief ETM Class Queue table Update Actions */
typedef enum _netc_tb_etmcq_update_action
{
    kNETC_CQCfgEUpdate = 0x1U, /*!< Configuration Element Update */
    kNETC_CQStsEUpdate =
        0x2U /*!< Statistics Element Update, all counters (except FRM_CNT) within the Statistics Element are reset */
} netc_tb_etmcq_update_action_t;

/*! @brief ETM Class Queue table config element */
typedef struct _netc_tb_etmcq_cfge
{
    netc_hw_etm_class_queue_idx_t cq2cgMap : 4; /*!< Class Queue to Congestion Group Mapping */
    uint8_t res0 : 4;
} netc_tb_etmcq_cfge_t;

/*! @brief ETM Class Queue table statistic element */
typedef struct _netc_tb_etmcq_stse
{
    uint32_t rejByteCnt[2];   /*!< Reject Byte Count */
    uint32_t rejFrameCnt[2];  /*!< Reject Frame Count */
    uint32_t deqByteCnt[2];   /*!< Dequeue Byte Count */
    uint32_t deqFrameCnt[2];  /*!< Dequeue Frame Count */
    uint32_t dropByteCnt[2];  /*!< Dropped Frames, Memory Lost */
    uint32_t dropFrameCnt[2]; /*!< Dropped Frames, Memory Recovered */
    uint32_t frmCnt;          /*!< Frame Count */
} netc_tb_etmcq_stse_t;

/*! @brief ETM Class Queue table request data buffer */
typedef struct _netc_tb_etmcq_req_data
{
    netc_tb_common_header_t commonHeader;
    uint32_t entryID;
    netc_tb_etmcq_cfge_t cfge;
} netc_tb_etmcq_req_data_t;

/*! @brief ETM Class Queue table request response data buffer */
typedef struct _netc_tb_etmcq_rsp_data
{
    uint32_t entryID;
    netc_tb_etmcq_stse_t stse;
    netc_tb_etmcq_cfge_t cfge;
} netc_tb_etmcq_rsp_data_t;

/*! @brief ETM Class Queue table data buffer */
typedef struct _netc_tb_etmcq_data
{
    union
    {
        netc_tb_etmcq_req_data_t request;
        netc_tb_etmcq_rsp_data_t response;
    };
} netc_tb_etmcq_data_t;

