JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief Shared Buffer Pool table request response data buffer */
typedef struct _netc_tb_sbp_rsp_data
{
    uint32_t entryID;
    netc_tb_sbp_sbpse_t sbpse;
    netc_tb_sbp_cfge_t cfge;
} netc_tb_sbp_rsp_data_t;

/*! @brief Shared Buffer Pool table data buffer */
typedef struct _netc_tb_sbp_data
{
    union
    {
        netc_tb_sbp_req_data_t request;
        netc_tb_sbp_rsp_data_t response;
    };
} netc_tb_sbp_data_t;

/*! @brief Shared Buffer Pool table entry config */
typedef struct _netc_tb_sbp_config
{
    uint32_t entryID;        /*!< Shared Buffer pool ID, range in 0 ~ (SWT_GetSBPTableEntryNum() - 1) */
    netc_tb_sbp_cfge_t cfge; /*!< Shared Buffer Pool table config element */
} netc_tb_sbp_config_t;

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion Shared Buffer Pool Table
#endif

/*! @brief Table common data buffer */
typedef union _netc_tb_data_buffer
{
    netc_tb_tgs_data_t tgs;     /*!< Time Gate Scheduling table data buffer */
    netc_tb_rp_data_t rp;       /*!< Rate Policer table data buffer */
    netc_tb_ipf_data_t ipf;     /*!< Ingress Port filter table data buffer */
    netc_tb_fdb_data_t fdb;     /*!< FDB table data buffer */
    netc_tb_l2mcf_data_t l2mcf; /*!< L2 IPV4 Multicast Filter table data buffer */
    netc_tb_vf_data_t vf;       /*!<  VLAN Filter table data buffer */
    netc_tb_isi_data_t isi;     /*!< Ingress Stream Identification table data buffer */
    netc_tb_is_data_t is;       /*!< Ingress Stream table data buffer */
    netc_tb_isf_data_t isf;     /*!< Ingress Stream Filter table data buffer */
    netc_tb_isc_data_t isc;     /*!< Ingress Stream Count table data buffer */
    netc_tb_sgi_data_t sgi;     /*!< Stream Gate Instance table data buffer */
    netc_tb_sgcl_data_t sgcl;   /*!< Stream Gate Control List table data buffer */
    netc_tb_fm_data_t fm;       /*!< Frame Modification table data buffer */
    netc_tb_fmd_data_t fmd;     /*!< Frame Modification Data table data buffer */
    netc_tb_et_data_t et;       /*!< Egress Treatment table data buffer */
    netc_tb_ec_data_t ec;       /*!< Egress Count table data buffer */
    netc_tb_etmcq_data_t cq;    /*!< ETM Class Queue table data buffer */
    netc_tb_etmcs_data_t cs;    /*!< ETM Class Scheduler table data buffer */
    netc_tb_etmcg_data_t cg;    /*!< ETM Class Group table data buffer */
    netc_tb_iseqg_data_t iseqg; /*!< Ingress Sequence Generation table data buffer */
    netc_tb_eseqr_data_t eseqr; /*!< Egress Sequence Recovery table data buffer */
    netc_tb_bp_data_t bp;       /*!< Buffer Pool table data buffer */
    netc_tb_sbp_data_t sbp;     /*!< Shared Buffer Pool table data buffer */
} netc_tb_data_buffer_t;

/*! @} */ // end of netc_hw_table
#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma endregion netc_hw_table
#endif

#if !(defined(__GNUC__) || defined(__ICCARM__))
#pragma region netc_hw_si
#endif
/*! @addtogroup netc_hw_si
 * @{
 */
/*! @brief Macro to cover VLAN PCP, DEI value to internal used pcpDei value. */
#define NETC_VLAN_PCP_DEI_VALUE(pcp, dei) (((uint8_t)((pcp)&0x7U) << 1U) | ((dei)&0x1U))

/*! @brief VLAN Ethertypes. */
typedef enum _netc_hw_enetc_si_vlan_type
{
    kNETC_ENETC_StanCVlan   = 0x1U, /*!< Standard C-VLAN 0x8100. */
    kNETC_ENETC_StanSVlan   = 0x2U, /*!< Standard S-VLAN 0x88A8. */
    kNETC_ENETC_CustomVlan1 = 0x4U, /*!< Custom VLAN as defined by CVLANR1[ETYPE]. */
    kNETC_ENETC_CustomVlan2 = 0x8U  /*!< Custom VLAN as defined by CVLANR2[ETYPE]. */
} netc_hw_enetc_si_vlan_type;

/*! @brief SI receive BD ring group index. */
typedef enum _netc_hw_enetc_si_rxr_group
{
    kNETC_SiBDRGroupOne = 0U, /*!< SI Rx BD ring group index one. */
    kNETC_SiBDRGroupTwo       /*!< SI Rx BD ring group index two. */
} netc_hw_enetc_si_rxr_group;

/*!
 * @brief Station Interface configuration.
 *
 */
typedef struct _netc_hw_enetc_si_config
{
    uint32_t bandWeight : 4;        /*!< Station interface traffic class bandwidth weight */
    uint32_t vlanCtrl : 4;          /*!< VLAN Ethertypes can be inserted by the SI driver, set with OR of @ref
                                       netc_hw_enetc_si_vlan_type. */
    uint32_t antiSpoofEnable : 1;   /*!< Anti-spoofing enable */
    uint32_t vlanInsertEnable : 1;  /*!< Software SI-based VLAN Insertion enable, avtive when enSIBaseVlan is true */
    uint32_t vlanExtractEnable : 1; /*!< SI-based VLAN removed from frame enable, avtive when enSIBaseVlan is true */
    uint32_t sourcePruneEnable : 1; /*!< Source pruning enable */
    uint32_t rxRingUse : 7; /*!< Number of Rx Rings to be used, when enable Rx ring group, this equal to the sum of all
                          Rx group rings. */
    uint32_t txRingUse : 7; /*!< Number of Tx Rings to be used, note that when SI is Switch management ENETC SI, the
                          number not include Tx ring 0. */
    uint32_t valnToIpvEnable : 1; /*!< Enable the VLAN PCP/DEI value (use NETC_VLAN_PCP_DEI_VALUE marco) to internal
                                     priority value mapping. */
    uint32_t rxBdrGroupNum : 2;   /*!< Rx BD ring group number, range in 0 ~ 2. */
    uint32_t ringPerBdrGroup : 3; /*!< The ring number in every Rx BD ring group, range in 1 ~ 8, active when
                                    rxBdrGroupNum not equal zero. */
    netc_hw_enetc_si_rxr_group
        defaultRxBdrGroup; /*!< The selected Rx BD ring group, active when rxBdrGroupNum not equal zero. */

    uint8_t vlanToIpvMap[16]; /*!< Frame VLAN pcp|dei to IPV mapping, active when valnToIpvEnable is true. */
    uint8_t ipvToRingMap[8];  /*!< BD ring used within the default Rx BD ring group for IPV n, active when rxBdrGroupNum
                                 not equal zero. */
    uint8_t vsiTcToTC[8]; /*!< Maps the VSI traffic class to transmit traffic class, done after the ENETC txPrio to TC
                             mapping, only available for VSI. */
    bool enSIBaseVlan;    /*!< Enable use SI-based VLAN information. */
    netc_enetc_vlan_tag_t siBaseVlan; /*!< SI-based VLAN information, active when enSIBaseVlan is true. */
} netc_hw_enetc_si_config_t;

