JayHeng/RT-MFB/devices/MIMXRT1189/drivers/fsl_netc.h
/*! @brief L2 Mac Filter Configuration for SI. */
typedef struct _netc_si_l2mf_config
{
    bool macUCPromis; /*!< Enable/Disable MAC unicast promiscuous. */
    bool macMCPromis; /*!< Enable/Disable MAC multicast promiscuous. */
    bool rejectUC;    /*!< Reject Unicast. */
    bool rejectMC;    /*!< Reject Multicast. */
    bool rejectBC;    /*!< Reject Broadcast. */
} netc_si_l2mf_config_t;

/*! @brief L2 VLAN Filter Configuration for SI. */
typedef struct _netc_si_l2vf_config
{
    bool acceptUntagged;  /*!< Accept/Reject untagged frame. */
    bool enPromis;        /*!< Enable/Disable VLAN promiscuous. */
    bool useOuterVlanTag; /*!< Use outer/inner VLAN tag for filtering. */
} netc_si_l2vf_config_t;

/*! @brief SI frame drop statistic struct. */
typedef struct _netc_si_discard_statistic
{
    uint32_t programError; /*!< Due to programming error ( non-existing BD ring or non-existing group, or SI disabled or
                              BD ring disabled). */
    uint32_t busError;     /*!< Due to system bus error. */
    uint32_t lackBD[14];   /*!< Due to lack of Rx BDs available. */
} netc_si_discard_statistic_t;

/*! @brief SI traffic statistic struct. */
typedef struct _netc_si_traffic_statistic
{
    uint64_t rxOctet;
    uint64_t rxFrame;
    uint64_t rxFrameUnicast;
    uint64_t rxFrameMulticast;
    uint64_t txOctet;
    uint64_t txFrame;
    uint64_t txFrameUnicast;
    uint64_t txFrameMulticast;
} netc_si_traffic_statistic_t;

/*! @brief SI Configuration. */
typedef struct _netc_si_config
{
    uint32_t tcBWWeight; /*!< SI traffic class bandwidth weight. */
} netc_si_config_t;

/*! @brief Configure SI vlan offload - Insert/Removal. */
typedef struct _netc_si_vlan_offload_config
{
    bool en;
    bool enInsert;
    bool enRemoval;
    netc_vlan_t vlan;
} netc_si_vlan_offload_config_t;

/*!
 * @brief Transmit Buffer Descriptor format.
 *
 * A union type cover the BD used as Standard/Extended/WriteBack format.
 */

typedef union _netc_tx_bd
{
    struct
    {
        uint64_t addr;                /*!< Address of the buffer. Little Endian. */
        uint16_t bufLen;              /*!< Length of buffer specifying effective number of bytes. */
        uint16_t frameLen;            /*!< Length of Frame. */
        uint32_t flags : 29;          /*!< Flags qualified setting. */
        uint32_t enableInterrupt : 1; /*!< Whether enable interrupt on complete of BD. */
        uint32_t isExtended : 1;      /*!< Extended BD format flag. */
        uint32_t isFinal : 1;         /*!< Final BD flag. */
    } standard;
    struct
    {
        uint32_t timestamp : 30; /*!< IEEE1588 PTP one-step timestamp. */
        uint32_t : 2;            /*!< Ignore 2-bit MSB. */
        uint16_t : 14;
        uint16_t tpid : 2; /*!< VLAN TPID type, see @ref netc_vlan_tpid_select_t. */
        uint16_t vid : 12; /*!< VLAN ID. */
        uint16_t dei : 1;  /*!< VLAN DEI. */
        uint16_t pcp : 3;  /*!< VLAN PCP. */
        uint32_t : 32;
        uint16_t : 16;
        uint8_t eFlags; /*!< Tx extension flags. */
        uint8_t : 7;
        uint8_t isFinal : 1; /*!< Final BD flag. */
    } ext;
    struct
    {
        uint32_t timestamp;   /*!< Timestamp write back. */
        uint32_t txtsid : 16; /*!/ Transmit timestamp identifier, only active on Switch management ENETC. */
        uint32_t : 16;
        uint32_t : 32;
        uint32_t : 16;
        uint32_t status : 9; /*!< Status. */
        uint32_t : 1;
        uint32_t written : 1; /*!< Write-back flag. */
        uint32_t : 5;
    } writeback;
} netc_tx_bd_t;

/*!
 * @brief Receive Buffer Descriptor format.
 *
 */
typedef union _netc_rx_bd
{
    struct
    {
        uint64_t addr; /*!< Software write address. */
        uint64_t : 64;
    } standard;
    struct
    {
        uint16_t internetChecksum; /*!< Internet Checksum. */
        uint16_t parserSummary;    /*!< Parser Summary. */
        union
        {
            struct
            {
                uint32_t srcPort : 5; /*!< Source port received from switch management port. */
                uint32_t : 3;
                uint32_t rssHash : 24; /*!< RSS Hash high field value. */
            };
            uint32_t rssHashSwt; /*!< RSS hash while not used as switch management port. */
        };
        uint16_t bufLen;   /*!< Length of received buffer. */
        uint16_t vid : 12; /*!< VLAN ID. */
        uint16_t dei : 1;  /*!< VLAN DEI. */
        uint16_t pcp : 3;  /*!< VLAN PCP. */
        uint8_t tpid : 2;  /*!< VLAN TPID. */
        uint8_t hr : 4;    /*!< Host Reason. */
        uint8_t : 2;
        uint8_t flags; /*!< Rx information flags. */
        uint8_t error; /*!< Rx error code. */
        uint8_t : 6;
        uint8_t isReady : 1; /*!< Received data ready flag. */
        uint8_t isFinal : 1; /*!< Final BD flag. */
    } writeback;
    struct
    {
        uint32_t timestamp; /*!< Rx Timestamp. */
        uint32_t : 32;
        uint64_t : 64;
    } ext;
    struct
    {
        uint32_t timestamp; /*!< Switch response timestamp. */
        uint32_t : 32;
        uint16_t txtsid; /*!< Transmit timestamp identifier. */
        uint16_t : 16;
        uint32_t : 2;
        uint32_t hr : 4; /*!< Host Reason. */
        uint32_t : 10;
        uint32_t error : 8;
        uint32_t : 6;
        uint32_t isReady : 1; /*!< Received data ready flag. */
        uint32_t isFinal : 1; /*!< Final BD flag. */
    } resp;
} netc_rx_bd_t;

/*! @brief Configuration for the SI Tx Buffer Descriptor Ring Configuration. */
typedef struct _netc_tx_bdr_config
{
    uint32_t len;                     /*!< Size of BD ring which shall be multiple of 8 BD. */
    netc_tx_bd_t *bdArray;            /*!< BDR base address which shall be 128 bytes aligned. */
    netc_tx_frame_info_t *dirtyArray; /*!< Tx cleanup ring. */
    // Interrupt
    bool enIntr;             /*!< Enable/Disable completion interrupt. */
    bool enThresIntr;        /*!< Enable/Disable threshold interrupt. */
    bool enCoalIntr;         /*!< Enable/Disable interrupt coalescing. */
    uint32_t intrThreshold;  /*!< Interrupt coalescing packet threshold. */
    uint32_t intrTimerThres; /*!< Interrupt coalescing timer threshold, specified in NETC clock cycles. */
    uint8_t msixEntryIdx;    /*!< MSIX entry index of Tx ring interrupt. */
    // Configure
    bool isVlanInsert; /*!< Enable/Disable VLAN insert offload. */
    bool isUserCRC;    /*!< Enable/Disable user provided the CRC32 - FCS at end of frame. */
    uint8_t wrrWeight; /*!< Weight used for arbitration when rings have same priority. */
    uint8_t priority;  /*!< Priority of the Tx BDR. */
} netc_tx_bdr_config_t;

/*! @brief Transmit BD ring handler data structure. */
typedef struct _netc_tx_bdr
{
    netc_tx_bd_t *bdBase;            /*!< Tx BDR base address. */
    netc_tx_frame_info_t *dirtyBase; /*!< Tx cleanup ring base address. */
    uint16_t producerIndex;          /*!< Current index for transmit. */
    uint16_t cleanIndex;             /*!< Current index for tx cleaning. */
    uint32_t len;                    /*!< Length of this BD ring. */
} netc_tx_bdr_t;

